{"id": "3930271", "type": "utility", "number": "3930271", "country": "US", "date": "1976-01-06", "abstract": " A golf glove is disclosed having an extra finger pocket between the index and middle finger pockets for securing one finger of one hand of a golf player between the fingers of the player's other hand. ", "title": "Golf glove", "kind": "A", "num_claims": "4", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930272", "type": "utility", "number": "3930272", "country": "US", "date": "1976-01-06", "abstract": " A lock for a height-adjustable crib or playpen requires two distinct manual operations in order to release the lock on each crib leg. Each lock includes a rigid metal bracket which engages around the extensible part of the leg and is pivotally connected to a crib corner post. The bracket has a nose which projects into one of a series of openings in the extensible part of the leg then the bracket is swung against the leg part to prevent movement of the leg part relative to the post. The upper edge of the bracket is slotted to receive a latch pivotally connected to the corner post just above the bracket. The latch drops into the slot when the nose is engaged in one of the openings so that the bracket cannot be moved. ", "title": "Crib leg lock", "kind": "A", "num_claims": "3", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930273", "type": "utility", "number": "3930273", "country": "US", "date": "1976-01-06", "abstract": " A bed safety side rail arrangement which includes two opposite articulated side rail assemblies selectively pivotally movable from an upper safety position to a lowered position, as for patient transfer and handling and/or bedmaking tasks. The opposite side rail assemblies are readily removably secured to opposite sides of a bed, and desired structural rigidity is provided through the medium of tubular cross members or cross member assemblies which engage the side rail assemblies at their respective pivot connections. ", "title": "Bed safety side rail arrangement", "kind": "A", "num_claims": "24", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930274", "type": "utility", "number": "3930274", "country": "US", "date": "1976-01-06", "abstract": " The assembly includes a longitudinal axis and opposite end surfaces transverse to the longitudinal axis. The container has a structure effective to receive both liquids and gas mediums therein and has valves for introducing and exhausting both liquid and gas mediums. An elongated frame structure has a plurality of parallel linear support members wherein each support member is laterally spaced with respect to any other lateral support member, and a separate end frame portion connected at each end of the support members to form an open structural configuration for receiving the collapsible container. The elongated container is fastened to the frame structure with the longitudinal axis thereof disposed substantially parallel to the linear support members and each of the end surfaces of the container being disposed adjacent an end frame portion to support the container within the frame structure during use. The container is attached to the frame structure with one of the linear support members extending longitudinally along one side of the container with the opposing side of the container being free of a support member. The assembly may be used as a pontoon when the container is inflated with a gas fluid medium and is employable in other uses such as a fresh water reservoir, a ballast, a sea anchor, a pitch and roll stabilizer and the like when the container is not inflated or holdls a liquid fluid medium. ", "title": "Assembly for use in recreational activities", "kind": "A", "num_claims": "7", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930275", "type": "utility", "number": "3930275", "country": "US", "date": "1976-01-06", "abstract": " A novel slipper and its method of fabrication is described. The slipper comprises a substantially flat sole member with die-cut bounding edges onto which is heat-sealed an overlying arc-shaped vamp. The novel method is characterized by pre-tacking vamps at predetermined locations to a sole web, and substantially simultaneously heat-sealing each vamp to a sole and die-cutting the bonded sole and vamp from the sole web. ", "title": "Method of fabricating a slipper", "kind": "A", "num_claims": "9", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930276", "type": "utility", "number": "3930276", "country": "US", "date": "1976-01-06", "abstract": " An automobile conveyor for use in conjunction with a wheel spinning device for an automatic wheel washer including an endless chain having a plurality of selectively engageable dogs pivotally secured thereto. The dogs normally travel in a position to urge an auto through the washer whereat the outboard end is in close association with the chain and beneath the automobile first supporting surface. Operating means are included whereby when an automobile is in position at least one of the dogs will be automatically moved to a position where the dog extends above the automobile supporting surface, contacts a wheel, and urges the car through the washer apparatus. At the wheel spinning and washing station the chain is forced downwardly to a position whereat it passes beneath the mechanism necessary to perform the wheel spinning operation while still retaining the outboard end of the dog above the automobile supporting surface. The continual contact by the dog assures that the automobile moves through the washer apparatus in a continuous motion. ", "title": "Wheel spinning and vehicle conveying apparatus for automatic wheel washers", "kind": "A", "num_claims": "12", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930277", "type": "utility", "number": "3930277", "country": "US", "date": "1976-01-06", "abstract": " A Mobile Floor Sweeper including a rotatable cylindrical brush mounted on a mobile chassis, lever means for raising and lowering said brush relative to the chassis with plate means pivotally mounted on the chassis adjacent the brush together with lever means connecting the plate means with the means for raising and lowering the brush whereby the plate means follows the brush as it is raised and lowered and means for adjustably positioning one end of the brush relative to the chassis. ", "title": "Mobile floor sweeper", "kind": "A", "num_claims": "7", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930278", "type": "utility", "number": "3930278", "country": "US", "date": "1976-01-06", "abstract": " A device for removable attachment to a paintbrush to assist in cutting-in one flat surface to another is disclosed. It is formed of flat metal sheet cut to a configuration having a central portion with a foot depending from one end thereof and a pair of bendable arms extending laterally therefrom. The arms can be bent to a plane normal to the plane of the central portion to engage the opposite sides of the handle of a paintbrush, and the foot portion acts as a guide and shield against unintentional smearing. ", "title": "Paintbrush and guard attachment for edging", "kind": "A", "num_claims": "5", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930279", "type": "utility", "number": "3930279", "country": "US", "date": "1976-01-06", "abstract": " A rubber windshield wiper blade is clamped to rocker arms at several points along its length. The sides of the blade are formed with cavities at locations corresponding to the locations of the clamps so as to permit flexure of the blade without hindrance from the clamps. ", "title": "Rubber windshield wiper blades having increased flexibility at clamping points", "kind": "A", "num_claims": "2", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930280", "type": "utility", "number": "3930280", "country": "US", "date": "1976-01-06", "abstract": " Leaks are precluded in product containers with the bottle insert by structuring a rim thereon for establishing an inclined sealing interface. A diaphragm is structured within the bottle insert to provide either a cylindrical or a noncylindrical wipe over the particular type of applicator tip selected for use in the product container. Furthermore, provisions are incorporated within the bottle insert to block passage through the wiping diaphragm of misaligned comb type applicator tips and these provisions are made self-aligning for such tips with minor structural modification. ", "title": "Bottle insert for product container", "kind": "A", "num_claims": "15", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930281", "type": "utility", "number": "3930281", "country": "US", "date": "1976-01-06", "abstract": " A floor cleaning machine constructed as a carriage equipped with a pole and having at least one motor-driven cleaning implement or tool rotating about a vertical axis and for wet cleaning the floor or the like. From a fresh water supply per unit of time there flows-out a regulatable quantity of fresh water to which there is added a cleaning agent, this mixture flowing-out at the region of the cleaning implement or tool. The machine works the floor or the like with the fresh water-cleaning agent mixture by means of the cleaning implement and the thus resulting soiled water is sucked-up from the floor and collected in a separate soiled water container. The fresh water container which supplies the fresh water is formed by part of the machine housing body, whereas the soiled water container is constituted by a separate, portable container which when assuming its working position is enclosed in the machine housing. This soiled water container is connected via a seal to the suction compartment of a suction blower and is protected from over filling by means of an automatically operating level limiting device. Further, means are provided to ensure that the water of the mixture of air and soiled water which enters the machine does not contact the suction blower and also prevent the splashing water of the soiled water container which may splash around during movement of the machine from entering the suction blower. ", "title": "Floor cleaning machine", "kind": "A", "num_claims": "15", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930282", "type": "utility", "number": "3930282", "country": "US", "date": "1976-01-06", "abstract": " A machine designed to remove skin from the backs of poultry automatically and mechanically by conveying the back carcass members sequentially through a machine having processing stations operable in sequence to sever the kidney retaining membranes and remove the kidneys by vacuum; position the tail for mechanical maceration and removal by a set of coarse intermeshing rotating helical gear members; and, macerate and remove the skin from the back carcass member by a second set of intermeshing rotating helical gears of finer pitch than the first set, followed by the back carcass members, free of skin, are discharged to a collection receptacle. ", "title": "Machine for processing the backs of poultry", "kind": "A", "num_claims": "8", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930283", "type": "utility", "number": "3930283", "country": "US", "date": "1976-01-06", "abstract": " A poultry processing machine adapted to remove skin from certain parts of poultry, such as necks, thighs and breasts by arranging the same for passage along a substantially uniformly diminishing channel defined by the upper portions of a pair of rollers having spiral configurations thereon, guiding and feeding the pieces of poultry longitudinally along said channel, and the spiral configuration on the rolls engaging the skin on said pieces in a manner to pull the same therefrom in substantially intact condition from the pieces, and separately discharging the removed skins and pieces of poultry adjacent the exit end of the machine. ", "title": "Machine for removing skin from pieces of poultry", "kind": "A", "num_claims": "15", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930284", "type": "utility", "number": "3930284", "country": "US", "date": "1976-01-06", "abstract": " The invention involves pulling the hide mechanically from beef carcasses, in a manner such as to avoid hide and carcass damage without resorting to electric stimulus, and without the need for trimming knife labor in removing the hide effectively and advantageously from the skull of the carcass. ", "title": "Hide pulling method and apparatus", "kind": "A", "num_claims": "7", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930285", "type": "utility", "number": "3930285", "country": "US", "date": "1976-01-06", "abstract": " An apparatus and method wherein a tow of continuous filaments is fed to a tow cutter and severed into fibrous material of predetermined staple length while the fibrous material delivered from the tow cutter is fed to and through at least one textile picker. The fibrous material may be formed into laps at the picker for being subsequently processed through cards, or the fibrous material may be fed in loose fibrous form from the picker to a bank of cards. Means are provided for automatically controlling operation of the tow cutter and pickers and for controlling feeding of the fibrous material to the pickers. ", "title": "Apparatus and method for forming staple fibers and feeding the same to a picker", "kind": "A", "num_claims": "21", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930286", "type": "utility", "number": "3930286", "country": "US", "date": "1976-01-06", "abstract": " Wine or other beverage receptacle comprising a flexible container of sheet-like material having affixed thereto a valve which is capable of puncturing the sheet to provide an outlet, together with a rigid or semi-rigid support having an opening to receive and support the valve and to support the container and its contents in upright position for display and dispensing. ", "title": "Flexible container having valve with puncturing plunger", "kind": "A", "num_claims": "3", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930287", "type": "utility", "number": "3930287", "country": "US", "date": "1976-01-06", "abstract": " An adjustable strap comprising two pieces of relatively soft elastomeric elongated strips. The strips are interconnected, one strip having an opening through which the other strip passes. The strip having the opening has a longitudinal central elongated depression therein provided with a series of upstanding teeth; and the strip threaded through the opening is provided with an elongated series of upstanding teeth slanting in the opposite direction for engagement with the teeth in the depression at any desired point of adjustment along the strap, there being another connection between the two straps. ", "title": "Adjustable strap", "kind": "A", "num_claims": "6", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930288", "type": "utility", "number": "3930288", "country": "US", "date": "1976-01-06", "abstract": " In the handling of bundled articles, for example, logs and timber, it has been known to use a large variety of knots and tethering devices with what are known in the logging industry as toggles. Prior known techniques and devices have caused excessive wear on ropes and have been time consuming in forming attachments, particularly in log booms. The present invention provides a one piece toggle having a plurality of rope receiving holes therein and contoured to permit rapid threading of ropes for cables and reducing wear on the ropes or cables to a minimum. ", "title": "Toggle for use with rope", "kind": "A", "num_claims": "8", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930289", "type": "utility", "number": "3930289", "country": "US", "date": "1976-01-06", "abstract": " For releasably interconnecting a first member and a second member such as, for example, a neck band or strap having a depending chain or the like and a musical instrument such as a saxophone there is provided a coupling device comprising a housing to which the chain is connected, opposed closure members being mounted within the housing with adjacent end portions of the closure members being resiliently urged by the inherent resiliency of the closure members towards a closed condition in which the saxophone is connectible thereto. A manually operable actuating member is mounted on the housing and is movable between a first position in which a portion of the actuating member which is of frusto-conical form, permits the adjacent end portions of the closure members to attain the closed condition, and a second position in which the frusto-conical portion of the actuating member urges the closure members to an open condition of the above-mentioned adjacent end portions thereof against the influence of the resilient urging of the closure members. ", "title": "Coupling device", "kind": "A", "num_claims": "5", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930290", "type": "utility", "number": "3930290", "country": "US", "date": "1976-01-06", "abstract": " There is disclosed a snap-shackle with a body having an interior cavity and first and second openings into the cavity, a hinge member being rotatably attached to the body to rotatably mate with and engage the second opening into the cavity. A latch member is pivotally attached to the body within the cavity and within the second opening, a portion of the latch member being exposed in the first opening through which opening the latch member is pivoted between a first pivotal position for engaging and locking the hinge member in the second opening to form a third opening between the hinge member and the body for receiving and coupling objects to the body and a second pivotal position for unlocking and releasing the hinge member to rotate and release the objects coupled thereby. ", "title": "Snap-shackle", "kind": "A", "num_claims": "5", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930291", "type": "utility", "number": "3930291", "country": "US", "date": "1976-01-06", "abstract": " A combination slub catcher and tension control apparatus for use in the processing of yarn wherein a plurality of narrow parallel blades are supported at one side transversely to the path of travel of the yarn and a single rigid bar supported at the other side longitudinally of the path of the yarn. The confronting surfaces of the transversely and longitudinally supported blades and the bar define a narrow yarn passage. The transversely supported blades are supported in a holder in which they are individually yieldable to the passage of enlargements in the yarn and the longitudinally supported bar is supported on an eccentric for pivotal movement about an axis parallel to the transverse blades and for adjustment toward or from the transverse blades to adjust the width of the yarn passage. A tension lever is mounted on the upper end of the bar above the pivot axis for biasing the bar relative to the blades. ", "title": "Combination tension and slub catching device", "kind": "A", "num_claims": "4", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930292", "type": "utility", "number": "3930292", "country": "US", "date": "1976-01-06", "abstract": " Filament processing apparatus embodying the combination of one or more rotatable rollers for conveying a filament or a plurality of filaments axially spaced on said roller(s) and looped at least partially about the respective roller surfaces, and a tubular roller-threading device which is a longitudinally slotted tube having at least a curvate portion adjacent the respective roller(s). The filament, preferably either knotted at its feed end or attached to a plug at its feed end, is drawn through the tubular roller-threading device by a fluid stream applied at a single or axially spaced points into the tube. The longitudinal slot of the tube allows the fluid-conveyed filament to be drawn out of the tube when the filament is placed in tension, e.g., after it has been fed around the respective rollers, and processing thereof is ready to begin. ", "title": "Devices for threading filaments on rollers", "kind": "A", "num_claims": "20", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930293", "type": "utility", "number": "3930293", "country": "US", "date": "1976-01-06", "abstract": " A method for transferring a package of yarn supported by a transfer core to a replacement core including the steps of inserting the replacement core into the transfer core, removing the transfer core relative to the package of yarn and the replacement core, holding the package of yarn during withdrawal of the transfer core, and permitting the yarn and replacement core to interengage in completing the transfer of the yarn onto the replacement core. There is also provision for the steps of compressing the resilient core to reduce its size, compressing the package of yarn, and anchoring the replacement core against axial displacement. ", "title": "Method of replacing the transfer cores of yarn packages with resilient replacement cores", "kind": "A", "num_claims": "10", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930294", "type": "utility", "number": "3930294", "country": "US", "date": "1976-01-06", "abstract": " Burnishing tools are constructed for operating on internal and external cylindrical surfaces of substantial length to produce a compacted finished surface thereon. The burnishing tool has a mandrel with a truncated conical surface on which truncated conical rollers rotate as the tool is driven in rotation relative to the workpiece. By axially moving the mandrel and cage relative to each other the contraction and expansion of the rollers occurs. The rollers are retracted when the workpiece is to be removed therefrom or applied thereto and are expanded under a predetermined pressure into engagement with the workpiece for producing the burnishing operation under substantial pressure. The machine herein illustrated is self-contained having a pulley driven in rotation by an adjacently supported motor for rotating the burnishing tool while permitting the expansion and retraction of the rollers. ", "title": "Cylindrical surface finishing device", "kind": "A", "num_claims": "10", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930295", "type": "utility", "number": "3930295", "country": "US", "date": "1976-01-06", "abstract": " A method for fabricating a semiconductor diode array, utilizing an alignment tool to precisely position a plurality of diodes so that they can be bonded into a precision array. The alignment tool and a method for fabricating the tool are also disclosed. ", "title": "Tool for fabricating diode array", "kind": "A", "num_claims": "4", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930296", "type": "utility", "number": "3930296", "country": "US", "date": "1976-01-06", "abstract": " The invention is directed to a method of and machine for loading a scroll of film and take-up spool into a cartridge and assembling and sealing the cartridge. It includes the steps of supplying a web of film and backing paper to a scrolling mechanism and winding the webs into a scroll. A single guide track guides and assists in advancing the webs of film and backing paper to a winding spindle. Severing mechanisms are located along the guide track to cut the webs into the desired lengths. The winding spindle is engaged by the webs for scrolling within a socket on a first transport carrier. When scrolling is complete the spindle is withdrawn and the scroll is retained in the socket. An ultrasonic securing device is used to secure a free end of the scroll to a take-up spool carried in another socket of the carrier. A transfer mechanism then transfers the spool and scroll from the first carrier into the chambers of a waiting cartridge bottom carried on a further transport carrier device which transports the loaded cartridge bottom to a station where the cartridge cover is placed on the bottom portion. An ultrasonic welding mechanism then seals the cover to the bottom completing the cartridge. ", "title": "Method and machine for loading and assembling film cartridges", "kind": "A", "num_claims": "41", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930297", "type": "utility", "number": "3930297", "country": "US", "date": "1976-01-06", "abstract": " A fastener feed assembly for a tool such as a power screwdriver having a drive member such as a rotatable bit includes a base fixed to the tool and a nose assembly slidably related to the base. The nose assembly includes a workpiece engaging surface, and when the tool is moved toward the workpiece during a fastener driving operation, the base moves toward the nose assembly. A return spring separates the base and nose assembly when the tool is withdrawn away from the workpiece. A strip of fasteners is fed from a magazine along a feed path through the nose assembly with sequential fasteners located in a drive position. Normally the drive member is spaced from a fastener in the drive position. During movement of the tool toward the workpiece in a driving operation, the drive member moves into engagement with a fastener in the drive position, and then continues to move in order to drive the fastener into the workpiece. A pawl is engageable with the strip in order to advance the strip along the feed path. During the driving operation, a feed mechanism operates in response to movement of the base toward the nose assembly to cock the pawl by moving it away from its home position along the strip away from the drive position. A lost motion arrangement delays cocking of the pawl until after secure engagement of the drive member with a fastener in the drive position. In response to withdrawal of the tool from the workpiece, the feed mechanism returns the pawl to its home position to feed an adjacent fastener of the strip to the drive position. Feed movement of the pawl is delayed until withdrawal of the drive member from the strip feed path. The strip includes a carrier with structure deformed during the drive operation for preventing reverse movement of the strip during cocking of the pawl. ", "title": "Fastener feed apparatus and method", "kind": "A", "num_claims": "23", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930298", "type": "utility", "number": "3930298", "country": "US", "date": "1976-01-06", "abstract": " The method of forming a tube fitting assembly is disclosed in a fitting having a first bore through a portion of the fitting and a second bore larger than the first bore and concentric with and through a portion of the first bore. A tubing having a diameter substantially equal to the first bore is engaged against an inside surface of the fitting defined by the end of the first bore. Relative movement between the fitting and the tube deforms the tubing wall to engage the first and second bores and to form an annular bead of the tubing wall outside of the fitting assembly. The bead is swaged into engagement with an outside surface of the fitting surrounding the second bore. The foregoing is merely a resume of one general application, is not a complete discussion of all principles of operation or applications, and is not to be construed as a limitation on the scope of the claimed subject matter. ", "title": "Method of forming a tube fitting assembly", "kind": "A", "num_claims": "8", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930299", "type": "utility", "number": "3930299", "country": "US", "date": "1976-01-06", "abstract": " A method and apparatus for end jointing timber members such as floor or ceiling joists by means of spiked timber connector plates, using apparatus incorporating equipment to position and hold the timber and automatically feed connector plates from cassettes or magazines holding a supply of connector plates onto magnetized pressing platens which then rotate to position the connector plates to span the joint to be made before passing the spikes into the relevant timber members. ", "title": "Methods of and/or apparatus for joining timber members", "kind": "A", "num_claims": "5", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930300", "type": "utility", "number": "3930300", "country": "US", "date": "1976-01-06", "abstract": "\" A junction field effect transistor having a \"\"V\"\" shaped upper gate, dividing said planar source and drain regions, formed by etching a (100) crystal oriented semiconductor material of one conductivity type and diffusing with material of opposite conductivity type. \"", "title": "Junction field effect transistor", "kind": "A", "num_claims": "8", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930301", "type": "utility", "number": "3930301", "country": "US", "date": "1976-01-06", "abstract": " A heavy machine tool, especially drilling and milling machine, which has a head stock with a supporting sleeve therein for receiving a boring spindle and a pull rod operable chucking device for chucking a tool head, and which also includes a device for depositing tool heads and placing the same in readiness for use. The housing for the tool head has on its outside a circular groove located at the side of the head stock in a plane which is located perpendicular to the axis of the boring spindle while within the range of movement of the tool head there is provided at least one device for depositing a tool and placing the same in readiness for use which last mentioned device includes a vertically arranged deposit plate the upper edge of which corresponds in shape to the shape of the arc of the annular groove and has a thickness corresponding to the width of said groove and upon which the tool head is adapted to be deposited by means of said annular groove, said range of movement of the respective tool head being determined by the displacement of said head stock, of said supporting sleeve, and/or the respective tool head. ", "title": "Heavy machine tool and device for depositing and placing a tool head in readiness for use", "kind": "A", "num_claims": "15", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930302", "type": "utility", "number": "3930302", "country": "US", "date": "1976-01-06", "abstract": " A machine tool includes an automatic tool change device for changing a tool between a tool change position on a tool storage magazine and a spindle by a tool change arm. A pair of guard covers are arranged between the tool change position and the spindle to be pivoted in a horizontal plane. A drive means is provided for normally maintaining the guard covers closed and for opening the guard covers to permit a tool change operation. ", "title": "Machine tool with guard cover apparatus", "kind": "A", "num_claims": "3", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930303", "type": "utility", "number": "3930303", "country": "US", "date": "1976-01-06", "abstract": " A manufacturing method of thermoelectric modules having slight internal resistance comprising very thin plates of P type and of N type stacked alternately and connection bridges between each plate of P type and the neighbouring plates of N type. The method is characterized in that after cutting out of the plates of P and N type an alternate sequence of plates of P type and of N type is formed by assembling plates, and by inserting, between two plates, insulating sheets every other one of which extends beyond the upper face of the assembly, the others extending beyond the lower face and then by immersion of the lower and upper faces in brazing material. ", "title": "Method for manufacturing compact thermoelectric modules", "kind": "A", "num_claims": "1", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930304", "type": "utility", "number": "3930304", "country": "US", "date": "1976-01-06", "abstract": " Supplementary metallized connection parts short-circuiting or connecting incremental sub-components of one or more circuit elements of an integrated circuit are laid down on the semiconductor slice at the same time as the usual metallized connection pattern is made. The components associated with the incremental sub-components are measured to determine the program of adjustment and selective burnout of the supplementary connections. The selective burnout is carried out by applying a sequence of pulses to the segments to be burned out under monitoring by a measuring circuit, which blocks the delivery of further pulses, either immediately or after one or a few more pulses, when the measuring circuit detects the opening of the connection. The process is preferably carried out on integrated circuits before the semiconductor slice on which they are made is separated into individual circuit units. The pulses are applied in sequences in which individual pulses or series of pulses have increasing amplitude and/or pulse duration and/or pulse frequency. ", "title": "Method and apparatus for selective burnout trimming of integrated circuit units", "kind": "A", "num_claims": "14", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930305", "type": "utility", "number": "3930305", "country": "US", "date": "1976-01-06", "abstract": " A method for manufacturing integrated circuits, said method comprising the steps of: PA1 Providing a first set of conductive zones on each of these portions of a substrate where electrical contacts are to be made, after having suitably doped said substrate with semiconductive material, PA1 Providing a selective insulating layer, so that the upper portions of said conductive zones be flush with the surface of said selective insulating layer, and PA1 Providing thereabove a second set of conductive zones adapted to constitute intended connections between said upper portions. Said method can be applied to the manufacture of MOS transistors. ", "title": "Method for manufacturing integrated circuits", "kind": "A", "num_claims": "2", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930306", "type": "utility", "number": "3930306", "country": "US", "date": "1976-01-06", "abstract": " A thermally and electrically conductive metal lead member is joined to the refractory metal contact member of a semiconductor device using a brazing alloy comprising on a weight basis about 80-89 percent copper, about 5-15 percent silver, and about 4-6 percent phosphorus. The contact member/semiconductor joint may be formed in an inert atmosphere at the same time and at the same temperature as the contact member/lead member joint. ", "title": "Process for attaching a lead member to a semiconductor device", "kind": "A", "num_claims": "27", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930307", "type": "utility", "number": "3930307", "country": "US", "date": "1976-01-06", "abstract": " The method and apparatus includes the use of at least one pallet, an assembly line, a projector means, and an electrical testing means. Assembly of the wiring harnesses takes place on the pallets which are either independently powered or move on a powered conveyor line. In either alternative, the pallets move along a non-synchronous, power and free assembly line. An overhead projector means is provided above selected work stations to project instructions and diagrams on the pallet. Electrical testing means are used to test the wiring harnesses during assembly, prior to completion of assembly, and to control movement of the pallet to the next work station. The method includes testing partially assembled components for electrical opens, shorts and incorrectly assembled components on the pallet at intermediate stages of assembly and passing the partially assembled components to the next stage of assembly only when the components have been shown to be correctly assembled. ", "title": "Assembly of wiring harness", "kind": "A", "num_claims": "13", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930308", "type": "utility", "number": "3930308", "country": "US", "date": "1976-01-06", "abstract": " The invention concerns connectors having an elongate spring body of elastomer or formed as a tubular spring about which a single layer wire coil is wound. The coil turns are separated by cutting the coil longitudinally of the body to define discrete conductive paths of C-shape extending round part of the circumferential profile of the body. Exposed surface portions of the wires present contact points in a row along the body. Each C-shaped turn may present a pair of diametrically opposite contacts. The coil may be wound about a former disposed beside the spring body so that on cutting the turn portions at the former leads to the individual C-shaped turn portions extend freely from the spring body. ", "title": "Substrate connectors", "kind": "A", "num_claims": "4", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930309", "type": "utility", "number": "3930309", "country": "US", "date": "1976-01-06", "abstract": " The knife has a slotted handle and a blade that pivots into and out of the slot of the handle. A free floating pivot pin extends through the slotted end of the handle and through the opening of the tang of the blade, and a slotted ring lock extends about the pivot pin. The ring lock is rotatable on the handle so that its slot is movable into and out of alignment with the slot of the handle, to lock the blade with respect to the handle. The periphery of the tang defines hemispherical indentations, and a spring-urged ball in the handle engages the tang and registers with the indentations so that the blade resists movement when in its folded or extended positions but is free to move when intermediate the end positions. ", "title": "Ring lock knife", "kind": "A", "num_claims": "7", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930310", "type": "utility", "number": "3930310", "country": "US", "date": "1976-01-06", "abstract": " A portable power tool having an annular ring tool, such as a saw blade or grinding wheel, driven on its periphery by a power unit. A ring tool housing carries the ring tool and is mounted to the power unit, the latter having a drive shaft roller which frictionally engages one surface of the ring tool. Ring tool guide bearings and ring tool support bearings oppose and cooperate with the drive roller to retain the ring tool within the housing during its rotation. The driven shaft axis is canted at an angle extending beyond the center of the ring tool or toward the working side of the ring tool to counteract the torque forces produced by the working operation. Means are also provided to vary the drive roller pressure on the ring tool to balance the torque or, alternatively, to vary the drive shaft axis angle to balance the torque thereby producing dynamic stability during the working operation regardless of work piece resistance. ", "title": "Stable power ring tool", "kind": "A", "num_claims": "12", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930311", "type": "utility", "number": "3930311", "country": "US", "date": "1976-01-06", "abstract": " A reinforced orthodontic bracket constructed of a translucent plastic for direct application to a patient's tooth as by an adhesive where the translucent bracket itself has a metallic reinforcement imbedded therein for added structural strength for the prevention of a displacement of the bracket because of forces applied by an arch wire attached thereto. ", "title": "Reinforced orthodontic bracket", "kind": "A", "num_claims": "1", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930312", "type": "utility", "number": "3930312", "country": "US", "date": "1976-01-06", "abstract": " A dental articulator comprises a pair of upper and lower brackets for upper and lower artificial dentures, respectively, with a support between the two brackets. The upper bracket is pivotally interconnected to the support for vertical swinging movement of the upper bracket relative to the occlusal plane of the articulator. The support and the lower bracket are slidably interconnected for relative movement in a forward and rearward direction parallel to the occlusal plane and perpendicular to the axis of vertical swinging of the upper bracket. The support and lower bracket can also have limited relative rotational movement in a plane parallel to the occlusal plane. A plate is insertable and removable in the articulator in inverted positions, so that in one position the upper surface of the plate lies in the occlusal plane and in the inverted position the under surface of the plate lies in the occlusal plane. ", "title": "Dental articulator", "kind": "A", "num_claims": "2", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930313", "type": "utility", "number": "3930313", "country": "US", "date": "1976-01-06", "abstract": " Drawing apparatus adapted for attachment to a drawing board and comprising a carriage supported for travel on the upper edge of the drawing board and carrying a depending rail which extends parallel to the lateral edges of the drawing board. A ruler-carrier head is slidably mounted on the rail. A linkage assembly constituted by two interconnected articulated parallel parallelogram linkages is connected by means of the short arm of one of the linkages to the carriage and by means of the short arm of the other of the linkages to the rear surface of the drawing board. ", "title": "Drawing apparatus", "kind": "A", "num_claims": "8", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930314", "type": "utility", "number": "3930314", "country": "US", "date": "1976-01-06", "abstract": " A drafting machine in which parallel support rails moveably support a rule or straight edge extending perpendicularly therebetween so the rule is moveable in parallelism with itself. The rule has a replaceable graduated working edge and carries an endless band which is parallel to the working edge and which has groups of graduations distributed therealong which can be brought into selective registration with the graduations on the working edge. The graduations on the endless band form reducing scales. The rule is profiled and slidably receivable in the profiled rail is an auxiliary instrument which may, conveniently, have a part pivotally mounted thereon for movement in a plane parallel to the work area over which the rule is moveable. The auxiliary instrument is also tiltable away from the working area to expose the working edge of the rule. ", "title": "Drafting machine", "kind": "A", "num_claims": "6", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930315", "type": "utility", "number": "3930315", "country": "US", "date": "1976-01-06", "abstract": " The method of the invention includes the steps of positioning a support member having a substantially vertically extending recording surface thereon in the doorway for which the door is being sized, recording the contour of each side door jamb of the doorway on the recording surface by transposing the contour with a tracer mechanism having a follower adapted to be advanced along each side door jamb and a marker for recording on the surface information corresponding to the contour of the side door jamb, placing the recorded information in a cutting apparatus having means for controlling a cutter device in correspondence with the recorded information so that the cutter device is advanced along each side of the door member to cut the sides of the door to match the contours of the associated side door jambs. The apparatus of the invention consists of a vertically extending support member having a sheet of material extended vertically therealong, a centering assembly for positioning the support along the central vertical axis of the door opening, and a tracer mechanism movable along the support member and having followers adapted to engage the side door jambs whereby markers on the tracer mechanism will mark lines on the sheet of material as the tracer mechanism is advanced along the support member with the lines corresponding in contour to that of the associated side door jamb. The support member also includes adjustable means for comparing the head door jamb with horizontal. ", "title": "Apparatus for sizing a door to fit a selected doorway", "kind": "A", "num_claims": "11", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930316", "type": "utility", "number": "3930316", "country": "US", "date": "1976-01-06", "abstract": " The rear sight of a firearm has a peephole device formed by a hollow tube, each of the two ends of which are closed by a peephole. Each peephole has a central orifice therein. The orifice of the peephole of the rear side has a larger diameter than the orifice of the peephole on the front sight side. Each peephole is pivotally mounted and cooperates with an elastic member which holds the peephole in its tube-opening or tube-closing position. In a further embodiment, two peepholes are provided at each end of the tube. ", "title": "Sighting means of a firearm", "kind": "A", "num_claims": "10", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930317", "type": "utility", "number": "3930317", "country": "US", "date": "1976-01-06", "abstract": " A system including a highly accurate electronic navigator mounted on a vele and the method of using same. Azimuth or position data from the navigator is repeated by a gyro in a remote head on the vehicle slaved by torque and signal cables to the navigator. If the gyro torque cables are opened, the remote head may be removed from the vehicle and mounted on some other body. The azimuth or position data of the body can then easily be determined from the position of the remote head relative to the navigator references. In particular, the invention is envisioned as usable in laying missiles or guns with the navigator and remote head being carried by a jeep or the like. ", "title": "Electronic azimuth transfer method and system", "kind": "A", "num_claims": "3", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930318", "type": "utility", "number": "3930318", "country": "US", "date": "1976-01-06", "abstract": " This invention relates to a conveyor for transporting sheets of material through an ultraviolet exposing chamber for curing and setting of a coat. Up to this time, the drying of solvent ink has involved considerable pollution problems, a fair consumption of natural gas and large and costly ovens with high temperature incineration systems. These problems have generally been brought about by long ovens wherein the metal sheet has been passed through once or twice in order to accomplish curing or drying. ", "title": "Ultraviolet curing machine", "kind": "A", "num_claims": "10", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930319", "type": "utility", "number": "3930319", "country": "US", "date": "1976-01-06", "abstract": " Apparatus for drying a travelling web, particularly a paper web. A hot air delivery structure is mounted adjacent the periphery of a steam heated cylinder to direct jets of hot air against travelling web supported on the cylinder. At least part of hot air delivery structure is moveable transversely of the cylinder periphery and the jets of hot air produce a surface effect to hold air delivery structure away from engagement with the web. Movement of hot air delivery structure is preferably achieved by flexure of that structure. ", "title": "Drying apparatus", "kind": "A", "num_claims": "17", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930320", "type": "utility", "number": "3930320", "country": "US", "date": "1976-01-06", "abstract": " A nail polish dryer to effect rapid drying of polish on fingernails or toenails and includes a base and a hood defining a drying space with an access opening for insertion of the portion of a person having nails to be dried. The base has walls therein defining an air passage through the base. An air moving fan positioned in the air passage is operative to move air around a heater and through an exit defined by one or more apertures in a top wall of the base. The heated air moves toward a rib or flow director extending from a hood in spaced relation to the apertures and operating to direct heated air onto polish on the nails of a user. The fan and heater is controlled by electric circuitry including a switch that is in circuit making position when engaged by the portion of a person extending into the drying space. ", "title": "Nail polish dryer", "kind": "A", "num_claims": "6", "filename": "pftaps19760106_wk01.zip"}
