{"id": "3930321", "type": "utility", "number": "3930321", "country": "US", "date": "1976-01-06", "abstract": " A game, primarily designed for preschool children, which includes a game board having a plurality of apertures located in the game board. Selected ones of the apertures have a first type of upstanding peg located within the aperture and the others of the apertures have a second type of upstanding peg within the aperture; the first pegs are longer, but the pegs and apertures are arranged to disguise the difference between the longer and shorter pegs. A card, or similar substrate, with questions on the top thereof can be disposed over the game board and this card or substrate will have a plurality of apertures therein capable of being aligned with certain of the apertures in the game board to provide multiple choice answers. A probe, or stylus, may be inserted in the apertures of the card and into the apertures of the game board. In the event that the player of the game inserts the stylus or probe into an aperture of the game board having the longer peg, the player will have selected an aperture corresponding to a correct answer. This peg of the first type is located to be inserted into the stylus to actuate a display member on the stylus such that the player of the game will recognize the selection of a proper answer in the multiple choice possibilities. In this way, visual and mechanical means are provided on the stylus or probe to indicate the correct answer. Moreover, the playing board is designed and the cards are designed with respect to the playing board so that a number of different cards with different questions and possibilities of answers are located at different positions on the cards. ", "title": "Question and answer game", "kind": "A", "num_claims": "11", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930322", "type": "utility", "number": "3930322", "country": "US", "date": "1976-01-06", "abstract": " A clog which comprises a body provided adjacent to one end with a first pair of through holes extending in parallel to each other and to the longitudinal axis of said body on the opposite sides of said axis in close proximity to the latter and adjacent to the other end with a second pair of through holes in proximity to the opposite side edges of said body at an angle with respect to said longitudinal axis; and a pair of identical pliable synthetic resin thongs of an ecliptical configuration in cross-section each having one end extending through one of said first pair of holes and the other end extending through one of said second pair of holes, the extensions at the opposite ends of said pair of thongs fused together to form lumps on the under surface of said clog body to prevent the thongs from separating from the clog body. ", "title": "Clog", "kind": "A", "num_claims": "1", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930323", "type": "utility", "number": "3930323", "country": "US", "date": "1976-01-06", "abstract": " A tensioning mechanism for the chain of a scraper elevator device that includes a pair of pivotally interconnected lever arms which support guide rollers. The lever arms are movable by an adjuster link in a scissors fashion for maintaining tension on the chain. ", "title": "Chain tensioning mechanism for scraper elevator device", "kind": "A", "num_claims": "2", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930324", "type": "utility", "number": "3930324", "country": "US", "date": "1976-01-06", "abstract": " A mechanical hole digging machine comprising a rotary cutting tool and a suction tube having an inlet opening adjacent to the cutting tool, a suction device for applying suction to the tube remote from the inlet opening to cause material cut away by the cutting tool to be sucked inwards through the inlet opening, the cutting tool and part at least of the suction tube being carried on a mounting by which they are movable upwards and downwards. An electromagnetic metal detector comprising three coils is mounted near the cutter head and adapted in use to give an indication of the presence of buried metal service pipe during a hole digging operation. ", "title": "Mechanical excavating machines including rotary cutter and suction tube", "kind": "A", "num_claims": "10", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930325", "type": "utility", "number": "3930325", "country": "US", "date": "1976-01-06", "abstract": " A steam iron soleplate, generator, and distributor subassembly of a thin soleplate with a coverplate spaced from and supported on the soleplate by spaced peripheral rib means to define a steam distributing passage therebetween. The coverplate is integrally attached to the soleplate by a continuous weld between the ribs and soleplate and steam generating means are provided in the upper surface of the cover-plate separate and spaced from the soleplate and ducted below to the steam passage means. A heat generating element forms an integral part of the coverplate for heat transfer to the soleplate through the ribs primarily by conduction. Both the method of assembly and the subassembly itself are disclosed. ", "title": "Steam iron soleplate construction", "kind": "A", "num_claims": "8", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930326", "type": "utility", "number": "3930326", "country": "US", "date": "1976-01-06", "abstract": " A desk calendar which permits the day, date and year to be changed by the simple manipulation of two dials, having, internally, a first and second shaft, each shaft controlling two rotatable drums. Each shaft has disposed thereon a first and second actuating member for operative engagement with a coupling device such that when the dialing member is turned in one direction the first drum will rotate and when the dial member is turned in the opposite direction the second drum will rotate. The same structure is related to the second shaft which is disposed on the other end of the frame having a separate dialing member associated therewith. ", "title": "Desk calendar", "kind": "A", "num_claims": "3", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930327", "type": "utility", "number": "3930327", "country": "US", "date": "1976-01-06", "abstract": " A signboard construction including four frame members which support a plurality of signboard members capable of receiving indicia on either side thereof. The frame members and the signboard members are all formed from aluminum extrusions. Each of the signboard members has a principal vertically extending structure, an upper structure which forms a groove, and three pairs of mounting ribs, the lower two pairs of ribs being mounted on intermediate spaced apart portions of the principal structure and the upper pair of mounting ribs being mounted on the groove forming structure. The lower edge of one signboard member can be received within the groove forming structure of another signboard member and in this manner a plurality of signboard members can be assembled together. The ends of the top, bottom, and end frame members are cut at 45 degree angles and are secured to each other by corner angles. Each of the frame members includes an inner portion provided with a first channel of relatively large width capable of receiving a pair of mounting ribs and a second channel disposed in the middle of the first channel, the second channel having a relatively small width capable of receiving the lower edge of the principal structure of a signboard member. When the parts are assembled together the first channel of the top frame member receives the top pair of mounting ribs of the top signboard member, and the second channel of the bottom frame member receives the lower edge of the bottom signboard member. ", "title": "Signboard assembly", "kind": "A", "num_claims": "6", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930328", "type": "utility", "number": "3930328", "country": "US", "date": "1976-01-06", "abstract": " An anchor and a slidably adjustably carried tie-line for a floatable decoy duck or the like comprising a generally elongated non-rustable metal body preferably wider at one end than at the other, a continuous passageway for said tie-line extending from and returning to one end of and partially through said body, said passageway having an open side for at least a portion of its length, an elastic member carried by said body and overlying the open side of said passageway and forcibly engaging said tie-line, whereby to resist free travel of said tie-line so that the required useable length of said tie-line beyond said anchor may be desirably determined for anchoring the decoy for limited movement when floating and for unit storage with said tie-line under tension on said decoy ready for re-use. ", "title": "Anchor and adjustable tie-line for floatable decoys", "kind": "A", "num_claims": "4", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930329", "type": "utility", "number": "3930329", "country": "US", "date": "1976-01-06", "abstract": " A bait molding device for forming and securing moldable bait material such as bread dough about a fishhook. A mold is formed of two cup shaped mold sections which are secured to pliers-like devices for opening and closing of the mold sections. The molds are of an elongate configuration to accommodate an entire fishhook and moldable bait material surrounding the fishhook within the mold sections. One of the mold sections includes a groove through one of the edges of the mold to permit the fishing line attached to the hook to pass through the mold when closed. ", "title": "Bait molding device", "kind": "A", "num_claims": "4", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930330", "type": "utility", "number": "3930330", "country": "US", "date": "1976-01-06", "abstract": " An outrigger clip for use in releasably securing a fishing line to the run-out line on an outrigger pole, the clip being constructed to reduce or eliminate fouling of the fishing line. The body and clip release arm are constructed so that the clip, when in use, will have a tendency to hang from the outrigger line instead of twisting, which causes fouling of the fishing line. The clip body itself is smooth about the edges so that any contact with a fishing line caused by slack or the like will prevent or prohibit snagging or fouling of the fishing line about the clip body itself. The clip includes a fishing line release arm with an adjustable tensioning means and an outrigger attaching wire disposed through the clip body at such a position to place the center of gravity of the body away from the attaching wire and the outrigger line. ", "title": "Outrigger fishing line release clip", "kind": "A", "num_claims": "2", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930331", "type": "utility", "number": "3930331", "country": "US", "date": "1976-01-06", "abstract": " A long loop of tubular textile material stuffed with fiber, foam or a cotton rope passes through a cushion body, so as to form a handle at the top and dangling legs at the bottom. The bottom of the cushion is straight and the remainder of the edge is a curve from the summit of which the handle protrudes. Features of a face and hands are provided on the front of the cushion. A pocket on the back, open to the top, is large enough for inserting the end portion of the dangling legs, and thereby giving the toy an attractive rest position. The toy thus has some aspects of a fanciful stuffed animal type doll, a handbag and a cushion, but it is designed to induce its child possessor to use the dangling legs for practice in tying knots. ", "title": "Toy for knot tying", "kind": "A", "num_claims": "8", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930332", "type": "utility", "number": "3930332", "country": "US", "date": "1976-01-06", "abstract": " A toy helicopter rotor comprises a hub with rotor blades radiating therefrom. The hub comprises upper and lower hub parts having formations which releasably lock the parts together upon relative turning therebetween. Each blade has a root which is received in a complementary recess in the lower hub part and is trapped by the upper part, whereby the blades are secured to the hub. Projections on the blade roots retain the blades against radial, lateral and torsional movement and prevent them flying out of the hub in use. ", "title": "Airfoil rotor for a toy helicopter", "kind": "A", "num_claims": "11", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930333", "type": "utility", "number": "3930333", "country": "US", "date": "1976-01-06", "abstract": " A coupling member for a toy vehicle drive system that may be employed in various play situations. The coupling member is generally comprised of an exaggerated triangularly-shaped portion and a funnel-shaped portion. The exaggerated triangularly-shaped portion allows the toy vehicle to be driven forward and backward, and also allows it to complete a U-turn and to be disengaged from the drive chain of the drive system. The funnel-shaped portion ensures that the toy vehicle may be engaged by the driven chain when the child desires to drive the toy vehicle in its forward direction. ", "title": "Coupling member for a toy vehicle drive system", "kind": "A", "num_claims": "7", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930334", "type": "utility", "number": "3930334", "country": "US", "date": "1976-01-06", "abstract": " A hanging apparatus for falls and hanging plant which includes a pair of liquid receptacles which are supported in respective top and bottom positions with the top liquid receptacle being substantially directly above the bottom receptacle. The top liquid receptacle is capable of dropping liquid from a plurality of locations to the bottom liquid receptacle, and the bottom liquid receptacle is positioned for and is capable of receiving the falling liquid so as to enable a multiple falls effect. At least one other receptacle is capable of supporting a hanging type plant. This plant receptacle is positioned above the bottom liquid receptacle, and the plant receptacle has a periphery which is different from the outside envelope of the falling liquid so that the hanging plant will not interfere with the falling liquid. ", "title": "Hanging apparatus for falls and hanging plant", "kind": "A", "num_claims": "14", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930335", "type": "utility", "number": "3930335", "country": "US", "date": "1976-01-06", "abstract": " This invention relates to a method and apparatus for growing plant life under controlled conditions including gas discharge lamps with electronic means utilized to provide predetermined pulses of electric current to the lamps so that bursts of radiant energy are supplied to the plant life, these bursts of energy being of a duration in the order of microseconds and at a periodicity that is favorable to the plant growing processes. The radiant energy supplied to the plant life is within the spectral range required for photosynthesis and is uniform to the photoreceptors of the plant life. ", "title": "Plant growth system", "kind": "A", "num_claims": "1", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930336", "type": "utility", "number": "3930336", "country": "US", "date": "1976-01-06", "abstract": " A window construction comprising vertically slidable and tiltable sash members having means for positively maintaining the tiltable sash in a partially-tilted position. ", "title": "Window construction", "kind": "A", "num_claims": "1", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930337", "type": "utility", "number": "3930337", "country": "US", "date": "1976-01-06", "abstract": " This window regulator of the parallel-motion type comprises two parallel links with a front run channel rigid with a curved guider rail reproducing the movements of the glass-supporting bottom channel, a rolling member rigid with said bottom channel engaging said guide rail, one of said links being pivoted to a fixed pin of said bottom channel and to a pivot pin carried by a fixed plate supporting the control mechanism, the other link being rigid with a rotary member coupled to said mechanism and pivoted by means of another rolling member to the bottom channel and also to a pin rigid with said plate, this window regulator being intended more particularly for curved quarter-light windows of motor vehicles. ", "title": "Window regulators for motor vehicles", "kind": "A", "num_claims": "5", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930338", "type": "utility", "number": "3930338", "country": "US", "date": "1976-01-06", "abstract": " An access door assembly provides a removable covering for an access opening in a wall panel. The assembly includes clip members frictionally mounted to the wall panel at spaced locations around the periphery of the access opening. A door overlies the opening and is dimensioned to cover the clip members as well as the opening. Spring-clip fastening elements releasably secure the door to the clip members and hold the door in position over the opening in the wall panel. ", "title": "Access door", "kind": "A", "num_claims": "7", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930339", "type": "utility", "number": "3930339", "country": "US", "date": "1976-01-06", "abstract": " The invention relates to a window regulator, especially for automobiles, in which the window is connected to a drive by a cable which can move axially in a tubular guide, a portion of this guide being parallel to the window travel and an adjacent portion being shaped in an arc, whereby the path of a catch connected to the cable and serving for connection with the window is not restricted solely to the portion of the tubular guide extending parallel to the window travel but also extends at least partly into the region of the arc, and whereby the connection between the catch and the window comprises a slide-guide extending transversely to the window path. ", "title": "Window regulator, especially for automobiles, with a threaded cable moving in a guide", "kind": "A", "num_claims": "4", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930340", "type": "utility", "number": "3930340", "country": "US", "date": "1976-01-06", "abstract": " A valve member for abrasive blasting machine in which the valve member is formed of a valve plate of magnetic material sandwiched between plates of larger dimension than the magnetic plate but of lesser dimension that the passage through which the abrasive material passes from the supply source to the blasting wheel whereby the annular space between the valve member and the inner walls of the passage becomes filled with abrasive material attracted to the valve member in closed position to close the passage. ", "title": "Shot control valves", "kind": "A", "num_claims": "5", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930341", "type": "utility", "number": "3930341", "country": "US", "date": "1976-01-06", "abstract": " A universal vertical grinding machine has a horizontal base supporting at least one workpiece carrier device. A vertical column centered on the base provides an axis of rotation for at least one collar rotatably mounted with reference to the column and provided with at least one head comprising a grinder-carrier spindle supporting a grinder adjacent the workpiece carrier device. Suitable arrangements are provided for effecting an axial sliding of the collar along the column in a reciprocating manner, and to independently rotate the collar about the column. Advantageously, there are two collars mounted for rotation about the column, with the collars being rotated in opposite directions. ", "title": "Universal vertical grinding machine", "kind": "A", "num_claims": "13", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930342", "type": "utility", "number": "3930342", "country": "US", "date": "1976-01-06", "abstract": " A sharpener having a clam-shell housing in which a motor is mounted for driving a grinding wheel disposed adjacent one end of the housing, a chuck which holds either twist drills or a diamond dresser, the chuck being indexable 180.degree. about its axis, and structure for mounting the chuck relative to the grinding wheel so that either the twist drill can be moved in a prescribed manner across the grinding periphery of the grinding wheel, or so that the diamond dresser can be moved across the grinding wheel in order to dress the wheel to a form suitable for sharpening twist drills or the like, and also means for moving the twist drills or the like or diamond dresser towards the grinding wheel. ", "title": "Sharpener for twist drills", "kind": "A", "num_claims": "30", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930343", "type": "utility", "number": "3930343", "country": "US", "date": "1976-01-06", "abstract": " Device for mounting specimens for the purpose of lapping, grinding and polishing metallographic specimens for microscopic analyses, comprising a rotatable polishing wheel with a number of specimen holders disposed thereabove, a driving roller centrally located with respect to the wheel and at least one supporting roller for each specimen holder, the rollers having wedge grooves engaged by peripheral edge portions of the specimen holders, and adjustable pressing members in the specimen holders for exerting pressure on the specimens and for maintaining proper frictional contact between the wedge grooves and the peripheral edge portions which constitute a frictional drive. ", "title": "Device for mounting specimens", "kind": "A", "num_claims": "7", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930344", "type": "utility", "number": "3930344", "country": "US", "date": "1976-01-06", "abstract": " A plastic covered building structure comprised of a metal frame supporting superimposed layers of plastic sheets having an inflated area between the sheets providing insulation to the interior of the structure. The superimposed plastic sheets are secured to the frame by means of longitudinally extending rails having longitudinally extending upwardly concave portions and complementary clamping rods adapted to secure the edges of the superimposed plastic sheets between the rods and the upwardly concave portions of the rail. The rails are adapted to receive clamping members at any point along the length of the rails to clamp the rods into the upwardly concave portions. ", "title": "Plastic covered building structures", "kind": "A", "num_claims": "8", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930345", "type": "utility", "number": "3930345", "country": "US", "date": "1976-01-06", "abstract": " A frost heave compensator for mobile homes and the like generally supported on a steel frame disposed below floor level, which steel frame is in turn supported on concrete or other relatively shallow footings. Each mobile home is provided with a plurality of longitudinally spaced resiliently compensating tiedowns disposed transversely across the top thereof and extending vertically downwardly on opposite sides thereof. ", "title": "Mobile home resilient frost heave compensators", "kind": "A", "num_claims": "4", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930346", "type": "utility", "number": "3930346", "country": "US", "date": "1976-01-06", "abstract": " An in-ground swimming pool, includes rigid planar ends, a pair of parallel inwardly-extending curved flanges on each said end, the sides and bottom being a sheet of flexible springy sheet material, capable of transportation in rolled form, the edges of said sheet being engaged between said flanges and a highly-compressed gasket of resilient material between said sheet and the inner flange of each said pair. ", "title": "Swimming pool", "kind": "A", "num_claims": "7", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930347", "type": "utility", "number": "3930347", "country": "US", "date": "1976-01-06", "abstract": " A plurality of structural unit bodies are utilized to construct a structure by suitably assembling the unit bodies. Each structural unit body comprises an outer flange and an inner flange extending from one end edge and the other end edge respectively of a box-shaped frame. A stuffed box is secured to the surface of the inner flange and the stuffed box is in the form of a flat box made of a dampproof material. The stuffed box is covered on the outside with a metal net-like material and has disposed therein a pipe capable of passing fluid therethrough. The box is stuffed with noncombustible materials. The upper portion of the middle section of the frame, the inside flange surface and the entire surface of the stuffed box is plastered or covered with mortar whereby there is formed a circumferential groove between the outer flange and the underside of the mortar. ", "title": "Structural unit body having a pipe incorporated therein", "kind": "A", "num_claims": "7", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930348", "type": "utility", "number": "3930348", "country": "US", "date": "1976-01-06", "abstract": " There are disclosed methods of splicing reinforcement across joints of pre-cast reinforced concrete sub-slabs for integrating such sub-slabs to define the underside layer of composite concrete continuously reinforced slabs formed without separate formwork other than shoring for the sub-slabs to define continuously reinforced spans and two-way flat plates, sub-slabs for use therein, joints formed thereby and building structures formed thereby. ", "title": "Reinforced concrete construction", "kind": "A", "num_claims": "2", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930349", "type": "utility", "number": "3930349", "country": "US", "date": "1976-01-06", "abstract": " A braced girder for steel-reinforced concrete construction, comprising a top chord connection to two bottom chords by a continuous lacing which forms a repeating pattern consisting of braces which are at least roughly perpendicular to the top chord, and of diagonal braces. At least two braces in the continuous lacing are perpendicular to the chord and follow each other consecutively. The girder has a triangular cross section. Where the two panel planes meet, the lacing forms a radius which is at least 0.4 times the diameter of the top chord. A method and apparatus for preparing such a girder are also disclosed. ", "title": "Braced girder of triangular section", "kind": "A", "num_claims": "4", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930350", "type": "utility", "number": "3930350", "country": "US", "date": "1976-01-06", "abstract": " The invention disclosed is directed to a packaging assembly including a body having an open channel for supporting a trough-shaped web having a product disposed therein; a cover cooperable with the body and the web to form a substantially air-tight chamber about the product, at least one of the body and the cover having a hole for aid in vacuumizing the chamber; means for moving the body and cover into and out of chamber-forming relation; and means operable within the chamber for sealing the web to form a sealed web package containing the product. A process for packaging is also disclosed. ", "title": "Packaging assembly and process", "kind": "A", "num_claims": "29", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930351", "type": "utility", "number": "3930351", "country": "US", "date": "1976-01-06", "abstract": " The present invention relates to a method and apparatus for transferring yarn packages doffed from a textile machine provided with a conveyer belt disposed along the longitudinal direction thereof, to a container. The yarn packages are carried to one end of the conveyer and then dropped into the container positioned at a receiving position below and next to the end of the conveyer. The dropping distance from the end portion of the carrying surface of the conveyer to the surface for receiving yarn packages in the container is always maintained at a substantially predetermined distance which is larger than the width L of one package, but smaller than the width of two packages. ", "title": "Method and apparatus for transferring yarn packages doffed from a textile machine to a container", "kind": "A", "num_claims": "6", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930352", "type": "utility", "number": "3930352", "country": "US", "date": "1976-01-06", "abstract": " An apparatus for packaging bread or the like into flexible bags, employing articulated scoops which are arranged to enter into the bag interior, engage the bag wall surfaces, and enable passage of product into the bag through the scoops. Pusher arm assemblies are employed to urge the continuous forward travel of product. A sensing device i.e. photo-electric cell, is employed to detect the absence of packaging bags and cause activation of a fresh supply of bags into the packaging station. ", "title": "Packaging machine", "kind": "A", "num_claims": "2", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930353", "type": "utility", "number": "3930353", "country": "US", "date": "1976-01-06", "abstract": " An apparatus for closing and sealing filled containers with a lid includes instrumentalities for positioning an individual lid beneath a sealing die which has an underside. The lid is temporarily held and finally joined to a container under the influence of heat and pressure. Suction is used to hold the lid against the underside of the die while it is being joined to the container. A plurality of protuberances are disposed at the underside of the sealing die. Each of the protuberances has an oblique surface. Each oblique surface has a point lying nearest a sealing surface defining an area of the underside, the area thus defined being substantially equal to that of the lid. Each lid can be consequently positioned correctly on a container and becomes fused therewith. ", "title": "Apparatus for closing and sealing containers with a lid", "kind": "A", "num_claims": "9", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930354", "type": "utility", "number": "3930354", "country": "US", "date": "1976-01-06", "abstract": " The device comprises at least one gatherer having two dividers and two advancing devices in the dividers for advancing severed stalks which have been severed by a cutting mechanism. Each advancing device comprises a front shaft and a rear shaft, the front shafts being parallel and upwardly and forwardly inclined and each carrying a rotary cutter adjacent the lower end of the shaft, a chain sprocket wheel and a rotary member fixed to the shaft adjacent the upper end of the shaft. An endless chain of each advancing device extends around the corresponding sprocket wheel. The rotary cutters are contained in the same plane and rotate in opposite directions. The rotary members co-operate with each other for seizing successive stalks before the stalks are severed and directing the stalks in a passageway defined by the dividers. ", "title": "Harvesting device in particular for an ensilaging machine", "kind": "A", "num_claims": "22", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930355", "type": "utility", "number": "3930355", "country": "US", "date": "1976-01-06", "abstract": " An apparatus for picking up melons lying on the ground, comprising: a frame; wheels supporting the frame; an upwardly and rearwardly sloping concave ramp carried by the frame and up which the melons are adapted to be rolled, the front end of the ramp being substantially at ground level; a melon pickup mechanism for rolling the melons up the ramp, comprising laterally spaced, coaxial tires mounted on the frame above the ramp for rotation about a transverse horizontal axis, the tires being above ground level and being engageable with melons on the ground ahead of the ramp to start the melons rolling rearwardly before they engage the front end of the ramp; a drive on the frame for driving the tires in a direction to cause them to roll the melons toward the front end of and up the ramp; and a transverse melon receiving conveyor at the rear end of the ramp. ", "title": "Melon harvester", "kind": "A", "num_claims": "6", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930356", "type": "utility", "number": "3930356", "country": "US", "date": "1976-01-06", "abstract": " A method and apparatus for influencing the ambient or surrounding conditions during open-end spinning, wherein the fibers are delivered to a spinning rotor or turbine by means of a conveying air stream and then spun into a yarn in such spinning rotor. The invention contemplates cooling the spinning rotor by providing a simultaneously flowing stream of cooling air which is separate from the conveying air stream. The apparatus aspects of this development contemplate disposing the side of the spinning rotor not impinged by the fiber material-conveying air stream in a compartment having inflow- and outflow openings for the cooling air stream. The outflow opening is operatively connected in flow communication with an air conveying device. ", "title": "Method and apparatus for influencing the ambient conditions during open-end spinning", "kind": "A", "num_claims": "12", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930357", "type": "utility", "number": "3930357", "country": "US", "date": "1976-01-06", "abstract": " Filling yarns are removed from a fabric woven on a double pick needle loom and then packaged on a revolving bobbin for subsequent re-use by interposing a ring and ring traveler through which traveler the yarn is led from the fabric to the bobbin package with a traverse of the yarn parallel to the axis of the bobbin, the traveler serving to compensate for the uneven flow rate of the filling yarn from the woven fabric. ", "title": "Recovery of filling yarns in a fabric woven on a double pick needle loom", "kind": "A", "num_claims": "5", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930358", "type": "utility", "number": "3930358", "country": "US", "date": "1976-01-06", "abstract": " An alarm vibrator control mechanism for a clock timer wherein an elongated lever extends along the lower portion of the timer for releasing an alarm vibrator at a preset time. The elongated lever is controlled by a selector shaft mechanism which is positioned at one side of the timer, a centrally located 12 hour alarm time gear and a disc cam which is connected to a units shaft at the other side of the timer. The 12 hour alarm time gear tilts the vibrator shutoff lever forwardly a few minutes before the alarm time and then the disc cam moves a right side portion of the elongated lever downwardly at the alarm time to release the elongated alarm shutoff lever from a notch which is formed in a base plate. ", "title": "Alarm clock timer", "kind": "A", "num_claims": "5", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930359", "type": "utility", "number": "3930359", "country": "US", "date": "1976-01-06", "abstract": " A digital cooking hours timer for providing an automatic cooking operation of a cooking apparatus for a selected time period and having a frame provided with a timer unit and a drive mechanism for driving the timer unit. A selector is carried by the frame to set a selected period of cooking time of the timer unit and is adapted to interconnect the drive mechanism with the timer unit so as to cause the drive mechanism to drive the timer unit for only the set period of cooking time, the timer unit having an output for operating the cooking apparatus at least part of the set period of cooking time as the set period of cooking time is elapsing. ", "title": "Digital cooking timer means having concentric time indicator disc and manual readout indicator", "kind": "A", "num_claims": "3", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930360", "type": "utility", "number": "3930360", "country": "US", "date": "1976-01-06", "abstract": " An alarm vibrator control mechanism for a clock timer wherein an elongated lever extends along the lower portion of the timer for releasing an alarm vibrator at a preset time. The elongated lever is controlled by a selector shaft mechanism which is positioned at one side of the timer, a centrally located 12 hour alarm time gear and a disc cam which is connected to a units shaft at the other side of the timer. The 12 hour alarm time gear tilts the vibrator shutoff lever forwardly a few minutes before the alarm time and then the disc cam moves a right side portion of the elongated lever downwardly at the alarm time to release the elongated alarm shutoff lever from a notch which is formed in a base plate to sound the alarm. A repeat alarm lever cooperates with a tab of the elongated lever to automatically shut off the alarm for a short time interval. ", "title": "Alarm clock timer", "kind": "A", "num_claims": "4", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930361", "type": "utility", "number": "3930361", "country": "US", "date": "1976-01-06", "abstract": " A slip wheel arrangement of a watch movement in which a center wheel is provided with an integral arbor which, in turn is formed with a double-tapered portion. For a slip-on coupling of a cannon pinion with the arbor, the pinion is formed with an integral tubular portion which includes a middle resilient part and a thickened end part, and is provided with at least one inwardly projecting projection on the resilient part. The leading portion of the bore of the tubular portion has a diameter larger than the sum of a largest diameter measured at the forward part of the arbor from the double-tapered part, plus the coupling idle gap measured thereat, with the inward projection being positioned within the area of the leading portion. ", "title": "Slip wheel structure of a watch movement", "kind": "A", "num_claims": "2", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930362", "type": "utility", "number": "3930362", "country": "US", "date": "1976-01-06", "abstract": "\" A clock \"\"friction\"\" for use in clocks having plastic gear wheels which permits manual setting of the hands but in which a reliable level of frictional torque is obtained without requiring use of any auxiliary parts. The centerwheel of the clock has an interference fit with respect to the center, or minute hand, shaft upon which it is telescoped, and the minute hand shaft is formed with an annular groove lying generally in the plane of the centerwheel into which the plastic relaxes and flows for maintaining the centerwheel in a desired axial position. The minute hand shaft has a setting knob, and means are provided for precluding axial shifting of the center shaft, by pushing or pulling, which might result in stripping of the plastic in the groove. \"", "title": "Means for developing friction in clock setting shaft", "kind": "A", "num_claims": "9", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930363", "type": "utility", "number": "3930363", "country": "US", "date": "1976-01-06", "abstract": "\" A parking meter which electrically indicates \"\"remaining time\"\" and which electrically operates only in the presence of a vehicle and when there is \"\"paid-for\"\" time on the meter. Thus, for example, unused time by one departing motorist is cancelled. \"", "title": "Parking meter", "kind": "A", "num_claims": "5", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930364", "type": "utility", "number": "3930364", "country": "US", "date": "1976-01-06", "abstract": " A bracelet primarily for a watch incorporates at least one link which can be disconnected from a neighbouring link to allow a unit to be added to or removed from the bracelet to alter its length. The unit consists of a link and a pivot element which is pivotally attached by one end to one end of the link and the other end of which has a pair of pivot projections for attachment to another link, e.g. of a similar unit. The said one link has at one end a pair of sockets facing opposite sides of the bracelet and these sockets have slots at their sides remote from said one end to enable the said pair of pivot projections on the pivot element of the unit to be engaged in and disengaged from the sockets. The said one link has a release member pivoted to it for movement into and out of a position in which a portion of the link blocks the slots to prevent disengagement of the pivot projections from the sockets. ", "title": "Bracelet primarily for a watch", "kind": "A", "num_claims": "12", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930365", "type": "utility", "number": "3930365", "country": "US", "date": "1976-01-06", "abstract": " A fuel control system for a gas turbine engine includes a metering device having a sleeve which is movable to vary fuel flow to the engine. A stop cooperates with the sleeve to define a minimum fuel flow. The stop is movable between a first, normal running position and a second, engine starting position, the second position corresponding to a smaller minimum flow through the metering arrangement. ", "title": "Fuel control system for gas turbine engine", "kind": "A", "num_claims": "4", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930366", "type": "utility", "number": "3930366", "country": "US", "date": "1976-01-06", "abstract": " A control system for a helicopter power plant with three power units driving the lifting rotor system through a main gearbox. Each power unit comprises a gas turbine engine of the gas-coupled type, a hydromechanical fuel control receiving electrical inputs to set a gas generator governor in the fuel control, an engine electronic control, and various engine accessories. The operation of the power plant is normally controlled by the pilot through condition levers and switches on a control quadrant, through a pitch control by which the collective pitch of the rotor blades is controlled, and through a master beeper switch which is operable to trim the setting of an isochronous governor for the rotor system and the gas generator governors. The condition lever of each engine transmits a speed command signal through the electronic control of each power unit to its gas generator governor. A signal of collective pitch transmitted from the rotor control system to each engine electronic control is another factor in setting the governor. The power plant includes a power management control, the principal function of which is to equalize the power outputs of the engines. It also includes the rotor isochronous governor. The power management control receives inputs of rotor system speed command and actual rotor speed and of the torques of the individual engines and transmits a governor trim signal to increase or decrease engine power to the several electronic controls. All signals are transmitted electrically between the rotor system, control panel, power management control, and engine electronic controls. Excessive engine torque during rotor startup is avoided. ", "title": "Helicopter power plant control", "kind": "A", "num_claims": "10", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930367", "type": "utility", "number": "3930367", "country": "US", "date": "1976-01-06", "abstract": " In a turbine powered generating system the rate of fuel flow for auxiliary firing of a steam turbine is automatically controlled to control the generation of steam for the turbine in accordance with turbine operating parameters and system power demands. Fuel flow rates are controlled within program selected limits to minimize stresses on the steam turbine, thus increasing the performance and life expectancy of the turbine. ", "title": "Fluid flow control system", "kind": "A", "num_claims": "14", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930368", "type": "utility", "number": "3930368", "country": "US", "date": "1976-01-06", "abstract": " A combustion liner suitable for an automotive gas turbine has variable primary and secondary air admission ports through the wall of the liner. The areas of these sets of ports are varied jointly by two annular valve sleeve assemblies reciprocable on the surface of the liner. Each valve sleeve assembly comprises an outer rigid ring, four approximately quarter-cylindrical valve plates extending around the outer surface of the liner within the ring and coupled to the ring for reciprocation by it, and a leaf spring disposed between the ring and each valve plate to hold the valve plate in contact with the liner. ", "title": "Combustion liner air valve", "kind": "A", "num_claims": "5", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930369", "type": "utility", "number": "3930369", "country": "US", "date": "1976-01-06", "abstract": " A combustion apparatus for gas turbine engines particularly adapted to reduce emissions to meet automotive requirements. The fuel is laid on the wall of a cylindrical prechamber and evaporated from the wall by combustion air which is introduced through a swirler at the upstream end of the prechamber. The inner surface of the prechamber is artificially roughened by a grid of grooves to improve fuel evaporation. The fuel is laid on the wall from an annular manifold extending around the upstream end of the prechamber through tangential orifices leading from the manifold into the interior of the prechamber. The fuel manifold is cooled and shielded from heat by an air jacket. More air enters through entrance ports distributed around the prechamber toward its downstream end. The resulting lean fuel-air mixture is delivered past an annular flow dam at the outlet of the prechamber into a combustion or reaction zone which is abruptly enlarged from the prechamber. The structure causes turbulent flow, recirculation, and good mixing in the reaction zone. A dilution zone downstream of the reaction zone has a circumferential array of dilution air ports which are of such shape as to be varied nonlinearly in area by a sliding ring valve. The sliding ring valve is coupled to a second sliding ring valve which varies the area of the air entrance ports in the prechamber in reverse sense to the dilution air ports. A pilot fuel nozzle to aid in cold starts is mounted at the upstream end of the prechamber. ", "title": "Lean prechamber outflow combustor with two sets of primary air entrances", "kind": "A", "num_claims": "2", "filename": "pftaps19760106_wk01.zip"}
{"id": "3930370", "type": "utility", "number": "3930370", "country": "US", "date": "1976-01-06", "abstract": " A mixed flow turbofan engine in which a portion of the core engine exhaust gases are passed into a pilot zone chamber where fuel is added thereto for vaporization therewith and wherein the fan air is passed over a series of vortex generators so that the vortex flow fan air and the vaporized fuel mixture will mix and combust rapidly in an augmentation combustion chamber. ", "title": "Turbofan engine with augmented combustion chamber using vorbix principle", "kind": "A", "num_claims": "29", "filename": "pftaps19760106_wk01.zip"}
