{"id": "WOS:000405992100135", "title": "Application of Distance Education Combined With Artificial Intelligence", "journal": "Agro Food Industry Hi-Tech", "date": "2017-01-01", "doi": "NA", "tot_cites": "0", "abstract": "The application of distance education combined with artificial intelligence has become a critical research focus because of the substantial advances in artificial intelligence technology. This study evaluates the application of artificial intelligence with distance education. Artificial intelligence was introduced and was integrated into the study on the innovation of distance education resources. The result was a distance education model combined with artificial intelligence. Results showed that the listening and speaking abilities and reading and writing skills of students could be improved remarkably by the application model of distance education combined with artificial intelligence."}
{"id": "WOS:000417125300001", "title": "Deep Learning: Branching into brains", "journal": "Elife", "date": "2017-12-05", "doi": "10.7554/eLife.33066", "tot_cites": "0", "abstract": "What can artificial intelligence learn from neuroscience, and vice versa?"}
{"id": "WOS:000426673200149", "title": "Application of Artificial Intelligence in Mechanical Engineering", "journal": "Proceedings of the 2nd International Conference on Computer Engineering, Information Science & Application Technology (Iccia 2017)", "date": "2017-01-01", "doi": "NA", "tot_cites": "0", "abstract": "With the development of computer technology, the application of artificial intelligence technology is more and more extensive. This paper summarizes the artificial intelligence technology, including its development process, composition. What's more, the concept of mechanical and electronic engineering is introduced and the relationship between mechanical and electronic engineering and artificial intelligence technology is analyzed. Finally, the development of artificial intelligence in mechanical fault diagnosis is summarized. Taking the fault diagnosis of hot forging press as an example to illustrate the specific application of artificial intelligence in mechanical engineering."}
{"id": "WOS:000429966800055", "title": "Research on the Progress of Computer Artificial Intelligence Algorithm", "journal": "Proceedings of the 2016 2nd International Conference on Materials Engineering and Information Technology Applications (Meita 2016)", "date": "2017-01-01", "doi": "NA", "tot_cites": "0", "abstract": "At present, computer artificial intelligence algorithm is still in development, and its application stability and accuracy is not very good. Therefore, relevant researchers are required to be committed to the research on computer artificial intelligence algorithm in order to gradually improve the level of computer artificial intelligence algorithm. Based on this, this paper will take computer artificial intelligence algorithm as the research object to make a research on the progress of computer artificial intelligence algorithm."}
{"id": "WOS:000426730000126", "title": "Development and Application of Artificial Intelligence", "journal": "Proceedings of the 2nd International Conference on Mechatronics Engineering and Information Technology (Icmeit 2017)", "date": "2017-01-01", "doi": "NA", "tot_cites": "0", "abstract": "Artificial intelligence is an emerging science, which studies and develops theoretical methods and techniques for simulating and expanding human intelligence. Today, artificial intelligence has made significant achievements in pattern recognition, knowledge engineering, robotics, etc. But it is far from the real human intelligence. Based on the elaboration of the concept of artificial intelligence, this study analyzes the development history, the current applicable fields of artificial intelligence, and looks forward to the future development trend. Meanwhile, we discuss the ethical dilemma faced or about to be faced by artificial intelligence technology."}
{"id": "WOS:000414864800117", "title": "Thinking about Artificial Intelligence", "journal": "Proceedings of the 2017 2nd International Conference on Machinery, Electronics and Control Simulation (Mecs 2017)", "date": "2017-01-01", "doi": "NA", "tot_cites": "0", "abstract": "As the development of information technology and computer technology, artificial intelligence is widely used in various related fields, and plays a greater role. In this work, firstly, we introduce the applications of artificial intelligence, such as Man-Machine war, intelligent robot, personal electronic assistant, etc. Secondly, we introduce the effects of artificial intelligence to the life, economic and social. Thirdly, we propose the issues of artificial intelligence. Lastly, we look forward to the future research on artificial intelligence."}
{"id": "WOS:000414859800114", "title": "Discussion on the development trend of agricultural science and Technology Advisory Service Based on Artificial Intelligence", "journal": "Proceedings of 3rd International Symposium on Social Science (Isss 2017)", "date": "2017-01-01", "doi": "NA", "tot_cites": "0", "abstract": "The development of artificial intelligence is the future direction of agricultural science and technology consulting services. This paper discusses the development of agricultural science and technology consulting service of artificial intelligence need, developing character, facing constraints and recommendations designed to provide advisory services on agricultural science and technology of artificial intelligence implementation and provides references for further promotion."}
{"id": "WOS:000405992100137", "title": "Teaching of Artificial Intelligence Courses Based on Design Based Research", "journal": "Agro Food Industry Hi-Tech", "date": "2017-01-01", "doi": "NA", "tot_cites": "0", "abstract": "With the development of society, artificial intelligence has been extensively applied, and the application of intelligent teaching has become a trend. The emergence of Design Based Research (DBR) provides opportunities, which makes research on artificial intelligence courses better and faster. As such, research on the teaching of artificial intelligence courses based on DBR was performed. The development status and application process of DBR were briefly introduced. With the development of artificial intelligence course teaching, the teaching of artificial intelligence courses based on DBR was studied. Results show that research on the teaching of artificial intelligence based on DBR is conducive to the development of artificial intelligence."}
{"id": "WOS:000417222700253", "title": "A Study on the Research Field and Social Influence of Computer Artificial Intelligence", "journal": "Proceedings of the 2017 5th International Conference on Machinery, Materials and Computing Technology (Icmmct 2017)", "date": "2017-01-01", "doi": "NA", "tot_cites": "0", "abstract": "The rapid development of artificial intelligence technology has formed a systematic trend and gradually constructed an intelligent technology environment, which will have a great impact on human life style. The systematic development and popularization of artificial intelligence will deeply influence the way of human life. Based on the author's learning and practical experience, this paper first analyzed the research fields of computer artificial intelligence, and then discussed the impact of computer artificial intelligence on the society."}
{"id": "WOS:000417222700292", "title": "Research on Application of Artificial Intelligence in Power System", "journal": "Proceedings of the 2017 5th International Conference on Machinery, Materials and Computing Technology (Icmmct 2017)", "date": "2017-01-01", "doi": "NA", "tot_cites": "0", "abstract": "This paper briefly introduces the basic concept of artificial intelligence technology and points out its application in power system. The basic conceptions of artificial intelligence technology such as expert system, artificial neural network, fuzzy theory, genetic algorithm and so on are introduced briefly. From the practical point of view, the characteristics and problems of their application in power system fault diagnosis are analyzed. It is pointed out that the integrated use of a variety of artificial intelligence technology is the latest development trend of the application of artificial intelligence technology in power system, and put forward specific suggestions."}
{"id": "WOS:000426676200052", "title": "Analysis of the Application of Artificial Intelligence in College English Teaching", "journal": "Proceedings of the 2017 2nd International Conference on Control, Automation and Artificial Intelligence (Caai 2017)", "date": "2017-01-01", "doi": "NA", "tot_cites": "0", "abstract": "Over the decades, the traditional method of teaching English in colleges has been widely criticized due to its various problems and shortcomings. This paper introduces the content of artificial intelligence, such as the concept, development and advantages of artificial intelligence, puts forward the artificial intelligence-based college English teaching system and analyzes the overall realization scheme of college English assistant teaching system based on artificial intelligence with a view to reducing the burden of teachers and improving teaching quality."}
{"id": "WOS:000416743800022", "title": "New Generation of Artificial Intelligence for Real-Time Strategy Games", "journal": "Advanced Research and Trends in New Technologies, Software, Human-Computer Interaction, and Communicability", "date": "2014-01-01", "doi": "10.4018/978-1-4666-4490-8.ch021", "tot_cites": "0", "abstract": "Artificial intelligence in computer games is still well behind academic artificial intelligence research. The computer power and memory resources have increased exponentially over the last few years and improved game artificial intelligence should not hinder the performance of the game anymore. Improvements of game artificial intelligence are necessary because an appropriate artificial intelligence for the more advanced players does not exist today. This chapter discusses artificial intelligence for real-time strategy computer games, which are ideal test beds for research on movement, tactic, and strategy. Open-source real-time strategy game development tools are presented and compared, and an enhanced combat artificial intelligence algorithm is proposed."}
{"id": "WOS:000348142500093", "title": "Research on Artificial Intelligence Technology of Electrical Automation Control", "journal": "Advanced Development in Automation, Materials and Manufacturing", "date": "2014-01-01", "doi": "10.4028/www.scientific.net/AMM.624.469", "tot_cites": "0", "abstract": "Progress of society and human longevity require more developed productive forces and more intelligent human economic life in order to save precious human time. Innovation in the field of electrical automation control needs artificial human support, and artificial intelligence advantage in terms of automation and control in this area are indeed able to get great play. This paper describes the connotation and characteristics of artificial intelligence technology. As well as the status of electrical automation control artificial intelligence technology. The applications of artificial intelligence technology are analyzed and discussed in the electric automation industry. Electrical automated production widely uses artificial intelligence technology to improve the productivity of electronic devices, reduce the harsh production costs, and improve production efficiency and competitiveness, which is an important guarantee for long-term development. The applications of artificial intelligence technology promote the development and progress of automation and solve difficult control problems."}
{"id": "WOS:000398133800023", "title": "Senses of Artificial Intelligence for Training Simulation in Private Security Industry", "journal": "2016 3rd International Conference on Power and Energy Systems (Pes 2016)", "date": "2016-01-01", "doi": "NA", "tot_cites": "0", "abstract": "This paper focuses on the senses of artificial intelligence for training simulation in private security industry. In this research, both description of modern programming technologies of senses of artificial intelligence in virtual simulator environment and proposal of the approach of the use of senses in training simulation of private security industry can be found."}
{"id": "WOS:000320140800100", "title": "Security System Of CNC Machine Tools Based On Artificial Intelligence", "journal": "Frontiers of Manufacturing and Design Science Iii, Pts 1 and 2", "date": "2013-01-01", "doi": "10.4028/www.scientific.net/AMM.271-272.488", "tot_cites": "0", "abstract": "This paper proposes to establish a CNC machine tool security system using artificial intelligence-based, and discusses the key technologies: the dynamic fuzzy neural network (DFNN), and based on this, describes an established security system of CNC machine tool."}
{"id": "WOS:000301469700033", "title": "CURRENT TRENDS IN DEVELOPMENT OF ELECTRONIC ADVERTISING", "journal": "Actual Problems of Economics", "date": "2012-01-01", "doi": "NA", "tot_cites": "0", "abstract": "The article considers prior theoretical researches and offers a new approach to the development of advertising as \"the electronic advertising with artificial intelligence\". The model of electronic advertising bearing artificial intelligence is constructed."}
{"id": "WOS:000405993100129", "title": "Research on the Application of Artificial Intelligence in NC Machine Tool System", "journal": "Agro Food Industry Hi-Tech", "date": "2017-05-01", "doi": "NA", "tot_cites": "0", "abstract": "As the development of today's era, more and more advanced technologies were invented and applied gradually. As one of the more widely used technologies, artificial intelligence technology was applied in more industries because of its high efficiency and precision and played a greater advantage. The application of artificial intelligence in the numerical control system was studied as the object of study, so as to provide some theoretical support for the application of artificial intelligence, but also to provide some scientific basis for the development mode of the later industry."}
{"id": "WOS:000426710100045", "title": "Research on the New Direction of Artificial Intelligence Development Writer", "journal": "Proceedings of the 7th International Conference on Education, Management, Information and Computer Science (Icemc 2017)", "date": "2017-01-01", "doi": "NA", "tot_cites": "0", "abstract": "Artificial intelligence is now well known to more and more people. Especially, AlphaGo won world go champion Leeshishi. And more and more families are using vacuum cleaners. In the development of artificial intelligence, there are different kinds of voices in society. Actually, there are also a lot of shortcomings. And that inevitably leads us to think about how to develop artificial intelligence, to study the new direction of development, to find a solution."}
{"id": "WOS:000365201200080", "title": "The Teaching Method Reformation for the Artificial Intelligence Course", "journal": "Proceedings of the International Conference on Education, Management and Information Technology", "date": "2015-01-01", "doi": "NA", "tot_cites": "0", "abstract": "According to the curriculum and the characteristics of artificial intelligence, we used auxiliary teaching system to reform the teaching method of artificial intelligence course. In the process of teaching, we used a large number of application examples to make abstract theory into the visualization and used the demonstration of algorithm to reify the complex problem. The students can feel the charm of the artificial intelligence technology. The training system was used to make students autonomous learning. Through many years of application, our method can improve the students' interest and ability in learning."}
{"id": "WOS:000380290700089", "title": "Application of Artificial Intelligence in Digital Music", "journal": "2015 International Conference on Applied Mechanics and Mechatronics Engineering (Amme 2015)", "date": "2015-01-01", "doi": "NA", "tot_cites": "0", "abstract": "The application of artificial intelligence has aided the development of many different fields. The most recognized applications are in science-tech related fields, but in fact, artificial intelligence has applications in some art related fields such as digital music, which is a combination of art and computer science. The passage discusses multiple application of artificial intelligence in digital music, analyzes the maturity of contemporary technologies, and makes a conclusion of those applications and its development prospect."}
{"id": "WOS:000418203600099", "title": "The Application of Artificial Intelligence in Modern Foreign Language Learning", "journal": "2017 7th International Conference on Education and Sports Education (Ese 2017), Vol 1", "date": "2017-01-01", "doi": "10.26602/lnms.2017.74.466", "tot_cites": "0", "abstract": "With the deepening of the globalization process, the study of various languages becomes necessary, and the application of artificial intelligence technology in foreign language learning has a huge space. This paper analyzes the application of artificial intelligence based on foreign language learning technology, we can design a comprehensive multi-angle artificial intelligence in multilingual language learning application of feasible technology to improve the efficiency. and interest of foreign language learning for the future development Multi - angle foreign language learning system and its application to do bedding."}
{"id": "WOS:000405526400010", "title": "The Emergence of Artificial Intelligence: How Automation is Changing Auditing", "journal": "Journal of Emerging Technologies in Accounting", "date": "2017-03-01", "doi": "10.2308/jeta-51730", "tot_cites": "2", "abstract": "This paper provides an overview of the emergence of artificial intelligence in accounting and auditing. We discuss the current capabilities of cognitive technologies and the implications these technologies will have on human auditors and the audit process itself. We also provide industry examples of artificial intelligence implementation by Big 4 accounting firms. Finally, we address some potential biases associated with the creation and use of artificial intelligence and discuss implications for future research."}
{"id": "WOS:000383740800022", "title": "Ethical Aspects and Future of Artificial Intelligence", "journal": "2016 1st International Conference on Innovation and Challenges in Cyber Security (Iciccs 2016)", "date": "2016-01-01", "doi": "NA", "tot_cites": "1", "abstract": "Artificial Intelligence is the intelligence shown by machines or software. Artificial intelligence includes reasoning, natural processing language and even various algorithms are used to put the intelligence in the system. In this paper we investigate motivations and expectations for the development of Machine Intelligence. This paper also presents the role of ethics in developing artificial intelligence. In this paper we have compared the new emerging AI scope with the old technologies in various fields and its advantages to the society."}
{"id": "WOS:000426670600268", "title": "Artificial Intelligence and the Problem of Computer Representation of Knowledge", "journal": "Proceedings of the 2nd International Conference on Contemporary Education, Social Sciences and Humanities (Iccessh 2017)", "date": "2017-01-01", "doi": "NA", "tot_cites": "0", "abstract": "The article developed the concept of epistemology of artificial intelligence (AI-epistemology), the concept of computer epistemology and the concept of computer representology. In this work, the understanding of artificial intelligence as a project, the theory and the totality of specific applications (so-called intellectual systems) differs; the analysis of the most important problem of artificial intelligence - the problem of computer representation of knowledge; the main stages of the development of the theory of artificial intelligence - classical, nonclassical and post-nonclassical - are analyzed and compared with the corresponding types of scientific rationality."}
{"id": "WOS:000416709400002", "title": "Unleashing Artificial Intelligence onto Big Data: A Review", "journal": "Handbook of Research on Computational Intelligence Applications in Bioinformatics", "date": "2016-01-01", "doi": "10.4018/978-1-5225-0427-6.ch001", "tot_cites": "1", "abstract": "We live in an ocean of data. Big Data is characterized by vast amounts of data sized in the order of petabytes or even exabytes. Though Big Data has great potential, Big data by itself has no value unless one can derive meaningful results from it. That is where Artificial Intelligence pitches in. Artificial Intelligence's most common application is about finding patterns in enormous quantities of data. The confluence of Big Data and Artificial Intelligence allows companies to automate and improve complex descriptive, predictive and prescriptive analytical tasks. In other words, Big Data can offer great insights with the help of Artificial Intelligence (AI). Artificial Intelligence can act as a catalyst to derive tangible value from Big data and serve as key to unlocking Big data. This review article focuses on applications of artificial intelligence to Big Data, its Limitations and issues."}
{"id": "WOS:000405993100036", "title": "Research on College English Teaching Design Combined with Artificial Intelligence", "journal": "Agro Food Industry Hi-Tech", "date": "2017-05-01", "doi": "NA", "tot_cites": "0", "abstract": "With the development of science and technology, artificial intelligence information technology has been applied to all aspects of modern teaching. In view of this, in this paper, the college English teaching combined with the artificial intelligence was designed, researched and analyzed. Firstly, the characteristics and performance of college English teaching model combined with artificial intelligence were analyzed by using teaching sequence research and hierarchical fuzzy comprehensive evaluation method, secondly, the comparative assessment was carried out with students' English achievements under the traditional English teaching, and finally, the artificial intelligence teaching was analyzed. The results showed that artificial intelligence teaching was conducive to improve students' English achievement."}
{"id": "WOS:000426994600290", "title": "Deductively Verifying Embedded Software in the Era of Artificial Intelligence = Machine Learning plus Software Science", "journal": "2017 Ieee 6th Global Conference on Consumer Electronics (Gcce)", "date": "2017-01-01", "doi": "NA", "tot_cites": "0", "abstract": "Today Google collects big data, and develops new business using both cloud computing such as search engine and artificial intelligence such as machine learning. The study of artificial intelligence mainly on deep learning is prosperous and is expected to make smart life now and in the future. The mainstream of the present artificial intelligence is machine learning, and the foundation is inductive inference. On the other hand, artificial intelligence from old days is deductive inference, and the deductive inference is the foundation of software science. In this paper, from the viewpoint of \"artificial intelligence = machine learning + software science\", we grasp computer technologies. We pay attention to software science, especially deductive inference of embedded systems, and explain deductive verifications for guaranteeing the reliability of embedded systems."}
{"id": "WOS:000425845200069", "title": "Brain Inspired Cognitive Artificial Intelligence for Knowledge Extraction and Intelligent Instrumentation System", "journal": "2017 International Symposium on Electronics and Smart Devices (Isesd)", "date": "2017-01-01", "doi": "NA", "tot_cites": "0", "abstract": "Artificial intelligence evolves with the development of computers even rely on computational development. The ways and processes of human thinking developed by Psychologists and welcomed by computational experts produce the science of Artificial Intelligence. This continues with the development of cognitive science that encourages the development of Artificial Intelligence to Cognitive Thinking Intelligence, a new pathway to the science of Artificial Intelligence that can emulate human cognitive abilities even if not 100%. Emulation of human cognitive abilities is developed based on the modeling of system interaction with the environment and information fusion, which can be used to conduct Inferencing, so when this occurs repeatedly it will produce knowledge that grows. This process is called Knowledge Growing System which is Brain Inspired Cognitive Artificial Intelligence and can be used for information extraction and when applied to instrumentation system will realize Intelligent Instrumentation System."}
{"id": "WOS:000390843800131", "title": "Research of Indoor Electric Energy Monitoring System based on the Technology of Artificial Intelligence", "journal": "2016 2nd International Conference on Social Science, Management and Economics (Ssme 2016)", "date": "2016-01-01", "doi": "NA", "tot_cites": "0", "abstract": "Based on artificial intelligence technology indoor electrical energy consumption monitoring system is a new type of energy inspection and monitoring system. Computer-based artificial intelligence technology can achieve real-time control of the indoor unit energy consumption. At present, energy conservation has become one of the main criteria for electrical equipment. And energy is measured by implementing artificial intelligence-based monitoring technology, can reduce the workload and accurate monitoring data. Indoor electrical equipment energy consumption data analysis is based on artificial intelligence techniques. Then, the control system design and research could explore whether accurate, complete monitoring device can be realized by artificial intelligence techniques based energy monitoring, and thus the system development and improvement of vision."}
{"id": "WOS:000386186100086", "title": "Artificial Intelligence: Technology and Application in Apparel Manufacturing", "journal": "Textile Bioengineering and Informatics Symposium Proceedings, 2016, Vols 1 and 2", "date": "2016-01-01", "doi": "NA", "tot_cites": "0", "abstract": "Apparel manufacturing is labor intensive, which is characterized by low fixed capital investment; a wide range of product designs and hence input materials; variable production volumes; high competitiveness and often high demand on product quality. To cater these demands, the labor intensive processes should be converted into automated processes accomplished by the use of computers, models, digital components and artificial intelligence. Artificial intelligence is the field of study that deals with the synthesis and analysis of computational agents that act intelligently. In this review, a systematic study has been done to explore various applications of artificial intelligence in apparel manufacturing. This also includes different types of artificial intelligence such as expert systems, neural network, Fuzzy logic, genetic algorithm and other approaches used in garment manufacturing."}
{"id": "WOS:000322498501081", "title": "Artificial Intelligence Study: A Two-sided Being-Teachings from Book of Changes", "journal": "Manufacturing Process and Equipment, Pts 1-4", "date": "2013-01-01", "doi": "10.4028/www.scientific.net/AMR.694-697.2295", "tot_cites": "0", "abstract": "To refer to Book of Changes and the complicated aspects of artificial intelligence, the paper holds that artificial intelligence study is a two-sided being. On the one hand, artificial intelligence study is a \"conflicted\" being, which concerns the universally acknowledged argument \"Can Machines Think?\" and the \"conflicts\" of diverse probing approaches, taking Symbolism, Connectionism and Behaviorism for instance. On the other hand, artificial intelligence study is a \"compromised\" being, which implies that a variety of factors function spontaneously and together, regarding the communication of science and philosophy, the cooperation of the related disciplines, the transformation of theories and practice, the unity of computer and man as well as the facilitation of scientists' research and the participation of society."}
{"id": "WOS:000414283700076", "title": "An Exploration on Artificial Intelligence Application: From Security, Privacy and Ethic Perspective", "journal": "2017 2nd Ieee International Conference on Cloud Computing and Big Data Analysis (Icccbda 2017)", "date": "2017-01-01", "doi": "NA", "tot_cites": "0", "abstract": "Artificial intelligence is believed as a disruptive technology, which will change our economy and society significantly in the near future. It can be employed to replace human labors in completing many dangerous and tedious tasks, providing us with more convenient and efficient life. We can benefit a lot from the wide application of this emerging technology. However, there are also potential risks and threats in application of artificial intelligence, which need to be handled in a proper way before extensive usage. In the paper, we make discussions on the security, privacy and ethnic issues in artificial intelligence applications and point out the potential risks and threats. Countermeasures in research, regulation and supervision are suggested and our expectation for artificial intelligence development is given out."}
{"id": "WOS:000405992100150", "title": "Research on Table Tennis Tactics Based on Artificial Intelligence", "journal": "Agro Food Industry Hi-Tech", "date": "2017-01-01", "doi": "NA", "tot_cites": "0", "abstract": "Chinese table tennis is a first-class sport that has attracted the attention of sports enthusiasts all over the world. This study investigates Chinese table tennis tactics based on artificial intelligence. The characteristics of traditional table tennis tactics were explained and analyzed, and the development and application of artificial intelligence technology were discussed. The advantages of the research methods based on artificial intelligence were compared with those of the traditional research methods. Studying table tennis tactics based on artificial intelligence can help coaches comprehensively understand the tactics of table tennis players and carry out effective and targeted training. This technology also provides future research with a new way to investigate table tennis techniques and tactics."}
{"id": "WOS:000427288000047", "title": "Artificial Intelligence-based Lightning Protection of Smart Grid Distribution System", "journal": "2017 International Symposium on Lightning Protection (Xiv Sipda)", "date": "2017-01-01", "doi": "NA", "tot_cites": "0", "abstract": "Benefited from the flexibility of Smart Grids, various dynamic lightning protection and Artificial Intelligence based lightning protection methods become available. Based on Artificial Intelligence technologies, the paper proposes a method of lightning-caused faults forecasting for Smart Grid distribution systems. A self-balancing dynamic lightning protection, which assists the self-healing function of a Smart Grid distribution network, is also presented in the paper. The Artificial Intelligence-based Lightning Protection, which is defined and described in the paper, provides more comprehensive lightning protection solutions to improve system reliability for the Smart Grids."}
{"id": "WOS:000427694200004", "title": "A Method for the Identification of Competence Centers Based on the Example of the Artificial Intelligence Domain", "journal": "Scientific and Technical Information Processing", "date": "2017-10-01", "doi": "10.3103/S0147688217040086", "tot_cites": "0", "abstract": "A method for the identification of competence centers is proposed using large scientific and technical document collections and computer-linguistic techniques. Artificial Intelligence was chosen as an example of the problem domain to test this method. The research is carried out on the basis of full-text proceedings of the National Conference on Artificial Intelligence, synopses of candidate's and doctoral theses, and the ELibrary. Major specialties with respect to defended theses on artificial intelligence were selected, a defense dynamic was constructed, scientometric indicators of scientists who work in the field of artificial intelligence were obtained, and basic competence centers and their specialization were detected."}
{"id": "WOS:000380798000046", "title": "Proposition of a Three Layers Architecture for Adaptable Artificial Intelligence", "journal": "2014 Joint 7th International Conference on Soft Computing and Intelligent Systems (Scis) and 15th International Symposium on Advanced Intelligent Systems (Isis)", "date": "2014-01-01", "doi": "NA", "tot_cites": "0", "abstract": "This paper proposes a concept of artificial intelligence architecture which would be usable in various kind of problems. Artificial intelligences are used in many areas of computer science for decision making tasks. Traditionally each artificial intelligence is designed and programmed to be used within a particular software and for a specific purpose. However, this paper stands as the first step of research in progress whose final objective is to create an artificial intelligence adaptable to all kinds of problems without any change in its source code. The present proposition focuses on the architecture of that artificial intelligence and is introduced in the context of video games. This architecture, composed of three layers, would be re-usable for all types of game."}
{"id": "WOS:000431615800005", "title": "Will It Be Possible for Artificial Intelligence Robots to Acquire Free Will and Believe in God?", "journal": "Beytulhikme-an International Journal of Philosophy", "date": "2017-12-01", "doi": "NA", "tot_cites": "1", "abstract": "This essay deals with the subject of whether artificial intelligence robots will gain consciousness in the future. The general perception of artificial intelligence robots and then the validity and rationality of this perception will be discussed. This is followed by a comparison between the structure of pre-programmed artificial intelligence robots and the structure of things in the nature. Then comes their comparison to human beings with regard to emotions, free will and ability to make a choice, and a discussion of their similarity to angels. Finally, the study will in detail deliberate over why artificial intelligence robots will not be able to have free will."}
{"id": "WOS:000405992300132", "title": "Research on interactive media art communication system based on artificial intelligence", "journal": "Agro Food Industry Hi-Tech", "date": "2017-01-01", "doi": "NA", "tot_cites": "0", "abstract": "Objective: in order to establish a more effective interactive media art communication system. Method: artificial intelligence technology. Process: use the AF-artificial fish algorithm in artificial intelligence technology to design the interactive media, forming a new interactive art communication system. Result & analysis: From the operation of the interactive media art communication system, we can see that the use of artificial intelligence technology, especially the AF-artificial fish algorithm can improve the dissemination effect and speed. The reason is that the AF-artificial fish algorithm is fast and accurate, which can effectively improve the robustness of the control effect and strengthen the stability of the system. Conclusion: it is effective that we use artificial intelligence method to construct interactive media art communication system."}
{"id": "WOS:000380466100002", "title": "Artificial Intelligence in the Web Age", "journal": "Proceedings of 2015 Ieee 14th International Conference on Cognitive Informatics & Cognitive Computing (Icci*cc)", "date": "2015-01-01", "doi": "NA", "tot_cites": "0", "abstract": "Due to the characteristics of web data and the change of men-machine interaction mode in the web age, artificial intelligence and information processing encounter new challenges and requirements. The new demand is that information processing has to deal with the meaning or semantics of information. Traditional information processing only treats the form of information rather than the meaning. Artificial intelligence intends to handle information as that of human beings, which makes machines to deal with the meaning or to understand the information. This talk presents new artificial intelligence technologies in the context of text and image processing, as well as intelligent robots. We will discuss how artificial intelligence may face the opportunity and challenge, and what strategy we will adopt to deal with them."}
{"id": "WOS:000316502800012", "title": "Intelligent Information Processing based on Classical Logic and Applied Mechanics", "journal": "Green Power, Materials and Manufacturing Technology and Applications Ii", "date": "2012-01-01", "doi": "10.4028/www.scientific.net/AMM.214.58", "tot_cites": "0", "abstract": "Intelligent information processing is one of important research parts of knowledge reasoning as well as methods in artificial intelligence. In this paper, the application of classical logic in artificial intelligence for intelligent information processing is mainly studied, and also accurate definitions of mathematical statements are given with logic rules, thus laying a good foundation for the research field of computer intelligent information processing."}
{"id": "WOS:000340565300069", "title": "Exploring Artificial Intelligence Utilizing BioArt", "journal": "Artificial Intelligence Applications and Innovations, Aiai 2013", "date": "2013-01-01", "doi": "NA", "tot_cites": "1", "abstract": "While artificial intelligence combined with Bioinformatics and Nanotechnology offers a variety of improvements and a technological and healthcare revolution, Bioartists attempt to replace the traditional artistic medium with biological materials, bio-imaging techniques, bioreactors and several times to treat their own body as an alive canvas. BioArt seems to play the role of a new scientific curator in order to manipulate laboratory aesthetics and bridge trans-humanism creations with culture and tradition."}
{"id": "WOS:000400628500004", "title": "Lapis Philosophorum, Artificial Intelligence and Perpetuum Mobile: the Evolution of Mutual Relations of Myth and Science", "journal": "Voprosy Filosofii", "date": "2017-01-01", "doi": "NA", "tot_cites": "1", "abstract": "The article reveals the evolution of interaction between myth and scientific theory on the example of the mythologies of the philosopher's stone, an artificial intelligence, and perpetuum mobile. Shows the historical development of these myths, and their current status. Special attention is paid to the influence of Christian myths in the formation of science."}
{"id": "WOS:000380498300026", "title": "The use of the argument structure of the verb in Spanish for Artificial Intelligence: a proposal", "journal": "Multimodal Communication in the 21st Century: Professional and Academic Challenges", "date": "2015-01-01", "doi": "10.1016/j.sbspro.2015.11.316", "tot_cites": "0", "abstract": "In the spirit of the subject of the XXXIII AESLA International Conference, multimodal communication in the 21st century, this paper offers a modest theoretical approach of the implementation of the predicative structure of the verb in Spanish to artificial intelligence by employing cognitive computing and machine learning. (C) 2015 The Authors. Published by Elsevier Ltd."}
{"id": "WOS:000309144100088", "title": "Overview of Intelligent Design on Mold", "journal": "Advanced Research on Industry, Information System and Material Engineering", "date": "2012-01-01", "doi": "10.4028/www.scientific.net/AMR.459.394", "tot_cites": "0", "abstract": "Applying Artificial Intelligence technology on mold design can help realize the design automation of mold. Because knowledge-based engineering is an effective intelligent design method, the paper systematically introduced the application and development of knowledge representation, knowledge reasoning, knowledge acquisition and other key technologies of knowledge engineering technology used in mold design field. Finally, the development tendency of mold design based on artificial intelligence was analyzed in detail."}
{"id": "WOS:000409071000002", "title": "On Some Artificial Intelligence Methods and Technologies for Cloud-Computing Protection", "journal": "Automatic Documentation and Mathematical Linguistics", "date": "2017-03-01", "doi": "10.3103/S0005105517020029", "tot_cites": "0", "abstract": "An overview of data-mining technologies used in applied information security systems is presented. The focus is made on a new and actively developing trend, cloud-computing media (including the so-called fog computing). The status and promising opportunities of using artificial intelligence models and methods to solve information security problems are also discussed."}
{"id": "WOS:000360111500003", "title": "FORMAL LANGUAGES: AN APPROACH TO ARTIFICIAL INTELLIGENCE", "journal": "Comunicazione Filosofica", "date": "2015-05-01", "doi": "NA", "tot_cites": "0", "abstract": "This article focuses on the connection between logic and artificial intelligence, by putting such two concepts in relation to artificial languages. Artificial languages are interpreted as instruments for transforming knowledge into action. Besides a short account of history of logic, the core of this paper is an attempt to outline a general framework of propositional logic to build a rational circuit."}
{"id": "WOS:000393905905063", "title": "The developing tendency of the fault diagnoses based on artificial intelligence", "journal": "Proceedings of the 31st Chinese Control Conference", "date": "2012-01-01", "doi": "NA", "tot_cites": "0", "abstract": "The classification of the latest progress of fault diagnoses based on artificial intelligence is given in this paper. The advantages and disadvantages of various fault diagnosis methods are discussed. The new developing trends of fault diagnoses, which are combined with various different artificial intelligences, are pointed out."}
{"id": "WOS:000302331900006", "title": "Reports on the 2011 AAAI Fourth Artificial Intelligence for Interactive Digital Entertainment Conference Workshops", "journal": "Ai Magazine", "date": "2012-03-01", "doi": "NA", "tot_cites": "0", "abstract": "The Seventh Artificial Intelligence for Interactive Digital Entertainment Conference (AIIDE-11) was held October 11-14, 2011 at Stanford University, Stanford, California. Two one-day workshops were held on October 11: Intelligent Narrative Technologies, and Artificial Intelligence in the Game Design Process. The highlights of each workshop are presented in this report."}
{"id": "WOS:000384467300070", "title": "Artificial Intelligence in Mineral Processing Plants: An Overview", "journal": "Proceedings of the 2016 International Conference on Artificial Intelligence: Technologies and Applications", "date": "2016-01-01", "doi": "NA", "tot_cites": "0", "abstract": "This work review the applications of artificial intelligence in the field of mineral processing in the last decade. The mineral processing industry is characterized for the lack of reliable models and on-line information about key process variables. Therefore, heuristic methods have been extensively used to accommodate the plant operation looking for better metallurgical results. Applications to flotation plants are discussed."}
{"id": "WOS:000346705600317", "title": "Machine Vision supported by Artificial Intelligence Applied to Rotatory Mirror Scanners", "journal": "2014 Ieee 23rd International Symposium on Industrial Electronics (Isie)", "date": "2014-01-01", "doi": "NA", "tot_cites": "0", "abstract": "A performance evaluation of different artificial intelligence methods for machine vision using a rotatory mirror scanner is presented. This assessment concludes importance results, in order to properly select a method for the development of an precise optical scanning system for machine vision, with application in Structural Health Monitoring and Robot Navigation task."}
