{"id": "WOS:000428641100002", "title": "Artificial Intelligence techniques used to detect object and face in an image: A Review", "journal": "2017 3rd International Conference on Computational Intelligence and Networks (Cine)", "date": "2017-01-01", "doi": "10.1109/CINE.2017.20", "tot_cites": "0", "abstract": "In the modern world of digitalization, the need to develop expert system in growing tremendously. Most of the expert system perceive environment as image, and for reading the components of image there are various techniques. This paper focuses on artificial intelligence algorithm that can be used to extract features from the image."}
{"id": "WOS:000380454900058", "title": "Artificial Intelligence Guidance for Unmanned Aerial Vehicles in Three Dimensional Space", "journal": "2014 International Conference on Contemporary Computing and Informatics (Ic3i)", "date": "2014-01-01", "doi": "NA", "tot_cites": "0", "abstract": "Unmanned Aerial Vehicle(UAV) are used in various applications like visual surveillance of natural resources, product delivery, armed attacks, disaster relief etc. This research proposes use of Artificial Intelligence (AI) for dynamic target tracking capability of an UAV. The AI guidance algorithm performance is compared against standard guidance algorithm like Proportional Navigation Guidance (PNG) algorithm."}
{"id": "WOS:000426868700075", "title": "Fading Intelligence Theory: A Theory on Keeping Artificial Intelligence Safety for the Future", "journal": "2017 International Artificial Intelligence and Data Processing Symposium (Idap)", "date": "2017-01-01", "doi": "NA", "tot_cites": "0", "abstract": "As a result of unstoppable rise of Artificial Intelligence, there has been a remarkable focus on the question of \"Will intelligent systems be safe for humankind of the future?\" Because of that, many researchers have started to direct their works on dealing with problems that may cause problems on enabling Artificial Intelligence systems to behave out of control or take positions dangerous for humans. Such research works are currently included under the literature of Artificial Intelligence Safety and / or Future of Artificial Intelligence. In the context of the explanations, this research paper proposes a theory on achieving safe intelligent systems by considering life-time of an Artificial Intelligence based system according to some operational variables and eliminate - terminate an intelligent system, which is 'old enough' to operate for giving chance to new generations of systems, which seem safer. The paper makes a brief introduction to the theory and opens doors widely for further research on it."}
{"id": "WOS:000390826700080", "title": "Genetic Algorithm Optimization Research Based On Simulated Annealing", "journal": "2016 17th Ieee/Acis International Conference on Software Engineering, Artificial Intelligence, Networking and Parallel/Distributed Computing (Snpd)", "date": "2016-01-01", "doi": "NA", "tot_cites": "1", "abstract": "As a kind of mature algorithm, genetic algorithm has been widely used in the field of Artificial intelligence and has played an important role in promoting the development of artificial intelligence technology. This paper analyzes the principle and characteristics of genetic algorithm and introduces an improved algorithm combining with simulated annealing algorithm and genetic algorithm. As an example of solving the TSP problem, this paper analyzes the advantages of the improved algorithm. We will discuss the development direction and prospect of genetic algorithm in the field of artificial intelligence."}
{"id": "WOS:000322283700039", "title": "Exploration and Practice of Full-English Teaching Mode Reform of Artificial Intelligence Course", "journal": "2012 International Conference on Education Reform and Management Innovation (Ermi 2012), Vol 5", "date": "2013-01-01", "doi": "NA", "tot_cites": "0", "abstract": "The paper firstly analyzes some urgent problems we usually meet during teaching Artificial Intelligence course in full-English in China. Some ideas of teaching mode reform are then proposed, including relocation of \"Full English\" teaching mode, innovation of teaching contents integrated with advanced, practical and cutting-edge, and reform of \"232\" teaching patterns. Through our teaching practice, some reform experiences of full-English teaching mode of Artificial Intelligence course are finally concluded in the paper."}
{"id": "WOS:000391644100175", "title": "Discussion on the Application of Artificial Intelligence to Computer Network Technology", "journal": "2016 3rd International Conference on Economic, Business Management and Educational Innovation (Ebmei 2016), Pt 2", "date": "2016-01-01", "doi": "NA", "tot_cites": "0", "abstract": "Artificial intelligence is a new technology in the information age and has been listed as one of the most influential top ten technologies in the 21st century. Now, it has been widely used in the field of computer network and gradually integrated with embedded technology, network information processing technology and wireless communication technology, etc. With the development of these technologies, computer network has gotten a broad application space. In this paper, by combining with artificial intelligence technology, the application of it to the field of computer network in China at present is studied."}
{"id": "WOS:000372947200017", "title": "Fifteenth International Conference on Artificial Intelligence and Law (ICAIL 2015)", "journal": "Ai Magazine", "date": "2016-03-01", "doi": "NA", "tot_cites": "0", "abstract": "The 15th International Conference on AI and Law (ICAIL 2015) was held in San Diego, California, USA, June 812, 2015, at the University of San Diego, at the Kroc Institute, under the auspices of the International Association for Artificial Intelligence and Law (IAAIL), an organization devoted to promoting research and development in the field of AI and law with members throughout the world. The conference is held in cooperation with the Association for the Advancement of Artificial Intelligence (AAAI) and with ACM SIGAI (the Special Interest Group on Artificial Intelligence of the Association for Computing Machinery)."}
{"id": "WOS:000312048600022", "title": "Awareness in Software-Intensive Systems", "journal": "Computer", "date": "2012-12-01", "doi": "NA", "tot_cites": "4", "abstract": "Closely related to artificial Intelligence, awareness depends on the knowledge transferred to software-intensive systems so they can use it to exhibit intelligence."}
{"id": "WOS:000398964800231", "title": "Research on Computer Science and Artificial Intelligence", "journal": "Proceedings of the 2016 4th International Conference on Electrical & Electronics Engineering and Computer Science (Iceeecs 2016)", "date": "2016-01-01", "doi": "NA", "tot_cites": "0", "abstract": "Since the first digital computer generated, artificial intelligence has been 50 years of development history. But AI did not stop and on the contrary, it has rapid development as always. AI takes computer as the core. The popularity and the expanding of the application range of the computer are changing our world and network technology will allow us into the digital information age. People continue to face a lot of new situations and new problems need to be explored at work, social life and other activities, so this article focuses on the relationship between computer science and artificial intelligence."}
{"id": "WOS:000376494300167", "title": "SACSIS, Vol. 5elected methods of artificial intelligence for Internet of Things conception", "journal": "Proceedings of the 2015 Federated Conference on Computer Science and Information Systems", "date": "2015-01-01", "doi": "10.15439/2015F161", "tot_cites": "0", "abstract": "The concept of Internet of Things appeared several years ago and in that time has evolved into one of pillars of the new technologies sector. The next step is to add the artificial intelligence to Internet of Things systems. Artificial intelligence is increasingly used in everyday life. It is a concept of a wide range and applies in practice in many fields of science. The aim of presented paper was to investigate the usefulness of selected artificial intelligence methods in the concept of Internet of Things. To investigate this purpose, exemplary system was built and it uses the artificial neural networks."}
{"id": "WOS:000414821900023", "title": "Artificial Intelligence: Threat or Boon to Radiologists?", "journal": "Journal of the American College of Radiology", "date": "2017-11-01", "doi": "10.1016/j.jacr.2017.07.007", "tot_cites": "4", "abstract": "The development and integration of machine learning/artificial intelligence into routine clinical practice will significantly alter the current practice of radiology. Changes in reimbursement and practice patterns will also continue to affect radiology. But rather than being a significant threat to radiologists, we believe these changes, particularly machine learning/artificial intelligence, will be a boon to radiologists by increasing their value, efficiency, accuracy, and personal satisfaction."}
{"id": "WOS:000339412900002", "title": "The Knowledge in Artificial Intelligence", "journal": "Advances in Mechatronics, Automation and Applied Information Technologies, Pts 1 and 2", "date": "2014-01-01", "doi": "10.4028/www.scientific.net/AMR.846-847.9", "tot_cites": "0", "abstract": "The objective of this work was to investigate the concept of knowledge in order to obtain useful for the techniques of artificial intelligence and knowledge representation. several definitions of knowledge proposed by various authors are analyzed, compared and graded, they are then merged into a new definition, which is partially formalized tools logical-algebraic, and finally, discusses the possible links with the areas of intelligence artificial intelligence and knowledge representation."}
{"id": "WOS:000390312500031", "title": "Smart City- A Gateway For Artificial Intelligence In India", "journal": "2016 Ieee Students' Conference on Electrical, Electronics and Computer Science (Sceecs)", "date": "2016-01-01", "doi": "NA", "tot_cites": "0", "abstract": "Major technological, economical and environmental changes have generated interest of man in creating technologically smarter and safer world to live in. Human intelligence combined with artificial intelligence have been very useful in developing cognitive competence, namely the brain like thinking Smart Machines, with highly sensitive sensors (sensory organs) and digitized, telecommunication networks (the nervous system). Smart Cities, thus developed and maintained by artificial intelligence would not only improve the lifestyle of people but will also make the society stronger and cohesive. This article gives an insight into realization of such thoughts."}
{"id": "WOS:000316502800123", "title": "A Simulation Research of Artificial Intelligence Control", "journal": "Green Power, Materials and Manufacturing Technology and Applications Ii", "date": "2012-01-01", "doi": "10.4028/www.scientific.net/AMM.214.640", "tot_cites": "0", "abstract": "The traditional control system can not meet the more complex control tasks of the problem, using artificial intelligence control method of imitation, artificial intelligence control system on the overall structure of the design, and given the specific control algorithms. System relies on accurately identify the various features of the error and make the appropriate decisions to multiplexing, open, closed loop control mode of combining control and solve the complex control of the process of identification, decision-making and control problems and achieve A unified identification control."}
{"id": "WOS:000427398300089", "title": "Research of Artificial Intelligence in the Retail Management Problems", "journal": "2017 Ieee Ii International Conference on Control in Technical Systems (Cts)", "date": "2017-01-01", "doi": "NA", "tot_cites": "0", "abstract": "This article explores the problems of automated retail systems, which named are vending machines. The main problem is the formation of an assortment of a vending machine, the realization of which will bring maximum profit. As a modern analysis tool of consumer demand in retail trade artificial intelligence is regarded. Attention is focused on one of the methods of constructing artificial intelligence through a neural network. The advantages of using a neural network such as learnability, dynamism, nonlinearity and others are shown."}
{"id": "WOS:000346911500006", "title": "Artificial Intelligence Basic Research Directions at the US Air Force", "journal": "International Journal on Artificial Intelligence Tools", "date": "2014-12-01", "doi": "10.1142/S0218213014600240", "tot_cites": "0", "abstract": "This survey gives a review of recent artificial intelligence-related research directions that are considered priority areas by the U.S. An Force and targeted for basic research funding by An Force Office of Scientific Research. These research areas include space situational awareness, autonomous systems, sensing and information fusion, surveillance, navigation, robust decision making, human-computer interfaces, and computational and machine intelligence. The possible contributions of artificial intelligence to these topics will be described and illustrated whenever possible by recently awarded grants."}
{"id": "WOS:000408079200003", "title": "DELL'S NEW DESTINY", "journal": "Forbes", "date": "2017-09-05", "doi": "NA", "tot_cites": "0", "abstract": "Michael Dell on artificial intelligence, managing creativity and turning the PC maker into a vertically integrated IT giant."}
{"id": "WOS:000402539900138", "title": "The Use of Artificial Intelligence in the Simulation of Transport of Cash and Valuables", "journal": "Proceedings of the 20th International Scientific Conference Transport Means 2016", "date": "2016-01-01", "doi": "NA", "tot_cites": "0", "abstract": "This research paper presents the research on the use of artificial intelligence in the virtual simulation of transport of cash and valuables in a commercial security industry. The analyze of the possibilities of implementation and use of methods and algorithms of artificial intelligence in a simulated group of perpetrators can be found in this article. The research is carried out in order to streamline the training of employees of private security."}
{"id": "WOS:000373157301057", "title": "Development and Application of Artificial Intelligence", "journal": "Proceedings of the 4th International Conference on Mechatronics, Materials, Chemistry and Computer Engineering 2015 (Icmmcce 2015)", "date": "2015-01-01", "doi": "NA", "tot_cites": "0", "abstract": "Since the successes of the Artificial Intelligence might increasingly impact on multiple subjects in new millennium, it is necessary to write a summary of the recent development of this technology. This paper refined four essential and important aspects of the Artificial Intelligence, summarized both successful cases and the viewpoints of researchers, and evaluated the cases on different laterals. Development of autonomous agent in the application areas, such as self-driving car and robotics should improve their performance. Biological computer technology with intelligence might be playing a key role in Computer Science area in future."}
{"id": "WOS:000390851500039", "title": "Research on Computer Network Teaching Based on Artificial Intelligence", "journal": "Proceedings of 2016 5th International Conference on Social Science, Education and Humanities Research", "date": "2016-01-01", "doi": "NA", "tot_cites": "0", "abstract": "With the development of technology change and the establishment of people's concept of lifelong learning education system, especially the popularity of computer networks, computer network education as a new educational model is entering a new stage of rapid development. However, a lot of confusion and difficulties encountered in practice to people's learning is a big obstacle. Application of artificial intelligence computer network education, to give people hope. This article describes the theory and techniques of artificial intelligence, and its specific application in the computer network teaching."}
{"id": "WOS:000416845300003", "title": "Artificial intelligence in cardiology", "journal": "Wiener Klinische Wochenschrift", "date": "2017-12-01", "doi": "10.1007/s00508-017-1275-y", "tot_cites": "0", "abstract": "Decision-making is complex in modern medicine and should ideally be based on available data, structured knowledge and proper interpretation in the context of an individual patient. Automated algorithms, also termed artificial intelligence that are able to extract meaningful patterns from data collections and build decisions upon identified patterns may be useful assistants in clinical decision-making processes. In this article, artificial intelligence-based studies in clinical cardiology are reviewed. The text also touches on the ethical issues and speculates on the future roles of automated algorithms versus clinicians in cardiology and medicine in general."}
{"id": "WOS:000405993200171", "title": "Research and Implementation of Financial Decision Model Based on Artificial Intelligence", "journal": "Agro Food Industry Hi-Tech", "date": "2017-05-01", "doi": "NA", "tot_cites": "0", "abstract": "Artificial intelligence has reached a new level in the global. Because of the improvement of the current neural network depth learning algorithm, some basic artificial intelligence technology has developed rapidly. In the financial sector, artificial intelligence can greatly optimize the process of a series of existing financial transaction, which can be applied and served to customers at the front end to achieve a variety of financial transactions and financial analysis decisions. Based on this, the research and implementation of financial decision model based on artificial intelligence were studied in this paper. The impact of artificial intelligence on the financial industry was introduced first. Technical problems and solutions, theoretical support and key technologies were introduced. Finally, the specific process of financial decision model based on Agent artificial intelligence was introduced in detail. The test results show that the financial decision model based on artificial intelligence can be used for risk prevention and control, which makes our financial services more personalized and intelligent, so that the financial risk control ability is more powerful."}
{"id": "WOS:000361603400008", "title": "Robotics at War", "journal": "Survival", "date": "2015-09-03", "doi": "10.1080/00396338.2015.1090133", "tot_cites": "1", "abstract": "Advances in artificial intelligence and platform performance raise the prospect that lethal remote-controlled systems will become increasingly autonomous."}
{"id": "WOS:000405992100241", "title": "Research on the Construction of Classroom Teaching Ability System OF English Teacher based on Artificial Intelligence", "journal": "Agro Food Industry Hi-Tech", "date": "2017-01-01", "doi": "NA", "tot_cites": "0", "abstract": "With the development of artificial intelligence technology, more and more work will be undertaken by the robot. Education model has also begun to add artificial intelligence, and more and more English training companies began to develop relevant artificial intelligence teaching products. In this paper, the basic concepts and theories of artificial intelligence were introduced and the different teaching methods that used the artificial neural network model were analyzed, and the in-depth analysis of relevant data was made, so the concept of EDAI English education was put forward. Through the questionnaire survey, the index of classroom teaching ability demand was obtained, and the changes of the quantitative measurement in the experimental class after the instruction of the artificial intelligence were introduced. The conclusion was that artificial intelligence can help English teachers, so as to improve the teachers' teaching ability."}
{"id": "WOS:000401925100083", "title": "Basic Understanding of Cognitive Radar", "journal": "Proceedings of the 2016 Ieee Andescon", "date": "2016-01-01", "doi": "NA", "tot_cites": "0", "abstract": "It is the purpose of this article to discuss about the definitions of Artificial Intelligence, Cognitive System and Cognitive Radar. Moreover, the concepts of Cognitive Radar will be described in this paper as their principal components, the technologies required to support these and Cognitive Radar Network."}
{"id": "WOS:000384389700016", "title": "The Israeli AI Community", "journal": "Ai Magazine", "date": "2016-09-01", "doi": "NA", "tot_cites": "0", "abstract": "This column provides an encounter with the artificial intelligence research community in the state of Israel. The first section introduces this community and its special attributes. The second section provides an overview of some recent research projects done in Israel. The author serves as the chair of the Israeli Association for Artificial Intelligence."}
{"id": "WOS:000403420500111", "title": "Artificial Intelligence and Infinity: Infinite Series Generated by Turing Machines", "journal": "Southeastcon 2017", "date": "2017-01-01", "doi": "NA", "tot_cites": "0", "abstract": "The paper points out a relation between the concept of infinity and Artificial Intelligence. Using a Turing Machine, equality under certain condition between two well known infinite series has been pointed out."}
{"id": "WOS:000386194000006", "title": "\"The reports of my death are greatly exaggerated\"-Artificial intelligence research in accounting", "journal": "International Journal of Accounting Information Systems", "date": "2016-09-01", "doi": "10.1016/j.accinf.2016.07.005", "tot_cites": "1", "abstract": "Gray et al. (2014) examined the productivity of expert systems/artificial intelligence research in accounting and came to the conclusion that both research on and practice use of expert systems/artificial intelligence had waned since the late 1990s. In our study, we reconsider these findings based on a broader view that is 'artificial intelligence' centric versus 'expert systems' centric. The results show that while there was a bit of a lull in the late 1990s, artificial intelligence research in accounting has continued to steadily increase over the past 30 years. Further consideration of artificial intelligence techniques as embedded modules in integrated audit support systems also suggest that use by practice continues to be robust. Based on these findings, we make a call for much more research on the usability, and use, of artificial intelligence techniques in accounting domains. Contrary to earlier perceptions, the research domain remains vibrant and holds great potential for AIS researchers to take a leadership role in advancing the field. (C) 2016 Elsevier Inc. All rights reserved."}
{"id": "WOS:000384790200007", "title": "Stifling artificial intelligence: Human perils", "journal": "Computer Law & Security Review", "date": "2016-10-01", "doi": "10.1016/j.clsr.2016.05.003", "tot_cites": "0", "abstract": "Although scientists have calculated the significant positive welfare effects of Artificial Intelligence (AI), fear mongering continues to hinder AI development. If regulations in this sector stifle our active imagination, we risk wasting the true potential of AIs dynamic efficiencies. Not only would Schumpeter dislike us for spoiling creative destruction, but the AI thinkers of the future would also rightfully see our efforts as the 'dark age' of human advancement. This article provides a brief philosophical introduction to artificial intelligence; categorizes artificial intelligence to shed light on what we have and know now and what we might expect from the prospective developments; reflects thoughts of worldwide famous thinkers to broaden our horizons; provides information on the attempts to regulate artificial intelligence from a legal perspective; and discusses how the legal approach needs to be to ensure the balance between artificial intelligence development and human control over them, and to ensure friendly artificial intelligence. (C) 2016 Gonenc Gurkaynak, Ilay Yilmaz & Gunes Haksever."}
{"id": "WOS:000361926600001", "title": "Innovative Applications of Artificial Intelligence 2014", "journal": "Ai Magazine", "date": "2015-09-01", "doi": "NA", "tot_cites": "0", "abstract": "This issue features expanded versions of articles selected from the 2014 AAAI Conference on Innovative Applications of Artificial Intelligence (IAAI) held in Quebec City, Canada. We present a selection of four articles describing deployed applications plus two more articles that discuss work on emerging applications."}
{"id": "WOS:000333251500039", "title": "Artificial Neural Network Promotion How to introduce Artificial Neural Networks to Students", "journal": "2013 International Conference on Process Control (Pc)", "date": "2013-01-01", "doi": "NA", "tot_cites": "2", "abstract": "The paper presents the possibility of introducing artificial intelligence and especially artificial neural network methodology to students in interesting way. To be more specific, the artificial neural network is described through the design of NPC's artificial intelligence in simple computer game."}
{"id": "WOS:000405993200130", "title": "Design and Application of the Artificial Intelligence in Online Test of English Computer", "journal": "Agro Food Industry Hi-Tech", "date": "2017-05-01", "doi": "NA", "tot_cites": "0", "abstract": "With the development of the information technology, the artificial intelligence is more and more involved in people's lives, and this huge change has a huge impact on the college English and computer teaching. Combing the artificial intelligence to design the online testing system can effectively solve problems as the shortage of teachers and monotonous teaching modes and other issues in the present college English teaching, so as to strengthen the students' autonomous learning abilities and improve the quality of teaching objectives. Based on this, according to the characteristics of the English teaching and computer science, the application of artificial intelligence in the online test platform was introduced; the important role of the artificial intelligence in the education platform and the improved organizational structure was analyzed in detail by using the computer aided teaching system (CAI). The results show that using the artificial intelligence to design online test platforms can effectively strengthen students' autonomous learning. In addition, this application can diagnose learner errors, and it also provides effective experience for artificial intelligence trainings in other ways of the education."}
{"id": "WOS:000423000000071", "title": "The importance of motivation and emotion for explaining human cognition", "journal": "Behavioral and Brain Sciences", "date": "2017-01-01", "doi": "10.1017/S0140525X17000164", "tot_cites": "0", "abstract": "Lake et al. discuss building blocks of human intelligence that are quite different from those of artificial intelligence. We argue that a theory of human intelligence has to incorporate human motivations and emotions. The interaction of motivation, emotion, and cognition is the real strength of human intelligence and distinguishes it from artificial intelligence."}
{"id": "WOS:000316387300038", "title": "Design on Computer Fault Diagnosis of Intelligence Tutoring System", "journal": "2012 International Conference on Control Engineering and Communication Technology (Iccect 2012)", "date": "2012-01-01", "doi": "10.1109/ICCECT.2012.250", "tot_cites": "0", "abstract": "This paper studied the model design of intelligence tutoring system based on the artificial intelligence theory, the designed intelligence tutoring system is used to diagnose computer fault according to computer fault diagnosis expert practical experience, and provide a studying platform on computer fault diagnosis for users themselves."}
{"id": "WOS:000423000000069", "title": "What can the brain teach us about building artificial intelligence?", "journal": "Behavioral and Brain Sciences", "date": "2017-01-01", "doi": "10.1017/S0140525X17000140", "tot_cites": "0", "abstract": "Lake et al. offer a timely critique on the recent accomplishments in artificial intelligence from the vantage point of human intelligence and provide insightful suggestions about research directions for building more human-like intelligence. Because we agree with most of the points they raised, here we offer a few points that are complementary."}
{"id": "WOS:000392232200036", "title": "Artificial Intelligence Applications in Power System", "journal": "Proceedings of the 2016 2nd International Conference on Artificial Intelligence and Industrial Engineering (Aiie 2016)", "date": "2016-01-01", "doi": "NA", "tot_cites": "0", "abstract": "The purpose of this paper is to research on artificial intelligence in power system operation and on transient protection, through the use of discrete control and the continuous control to increase the stability of the power system; transient protection is through the use of relay protection based on expert system and fuzzy logic in the protection setting calculation of expert and fault diagnosis, greatly improved the efficiency of solving the problem. This paper originally were studied in artificial intelligence in power system on steady and transient, introducing the most suitable method, which can be used as reference in practical application. All in all artificial intelligence is the ability using computers to perform some complex problems to solve, such as image recognition, judge the ability to understand the problem."}
{"id": "WOS:000426645100144", "title": "Analysis on the Application of the Artificial Intelligence Neural Network on the New Energy Micro Grid", "journal": "Proceedings of the 2017 4th International Conference on Machinery, Materials and Computer (Macmc 2017)", "date": "2017-01-01", "doi": "NA", "tot_cites": "0", "abstract": "The electricity of the micro grid mainly comes from the wind power, but generating power by wind is not steady, it brings some negative influences to the whole electricity system. So, it is necessary to improve the forecasting accuracy of the generating capacity by wind. It can make the whole electric grid steady by the artificial intelligence. On the base of analyzing the neural network and the micro grid of the new energy, this thesis researches the specific application of the artificial intelligence neural network on the micro grid of the new energy, and puts forward the countermeasures for improving their approaches if they want to harness the artificial intelligence neural network well. The writer of this thesis hopes this thesis could provide some references for the development of the electric grid of China."}
{"id": "WOS:000312318400001", "title": "Artificial Intelligence in Civil Engineering", "journal": "Mathematical Problems in Engineering", "date": "2012-01-01", "doi": "10.1155/2012/145974", "tot_cites": "23", "abstract": "Artificial intelligence is a branch of computer science, involved in the research, design, and application of intelligent computer. Traditional methods for modeling and optimizing complex structure systems require huge amounts of computing resources, and artificial-intelligence-based solutions can often provide valuable alternatives for efficiently solving problems in the civil engineering. This paper summarizes recently developed methods and theories in the developing direction for applications of artificial intelligence in civil engineering, including evolutionary computation, neural networks, fuzzy systems, expert system, reasoning, classification, and learning, as well as others like chaos theory, cuckoo search, firefly algorithm, knowledge-based engineering, and simulated annealing. The main research trends are also pointed out in the end. The paper provides an overview of the advances of artificial intelligence applied in civil engineering."}
{"id": "WOS:000419689700010", "title": "A REVIEW OF ARTIFICIAL INTELLIGENCE TECHNIQUES IN IMAGE STEGANOGRAPHY DOMAIN", "journal": "Journal of Engineering Science and Technology", "date": "2017-04-01", "doi": "NA", "tot_cites": "0", "abstract": "This paper reviews major work focusing on three main artificial intelligence techniques, which are neural network, genetic algorithm, and fuzzy logic. This review is based on the several general criterias, i.e. types of field, main goal, types of hidden-information, image domain, implementation stages, secret-key and localization of artificial intelligence techniques. Then, the summary of these reviews is discussed. The findings suggest that all these works should apply artificial intelligence techniques either during pre-processing, embedding or extracting stages or more than one of these stages. Therefore, the presence of artificial intelligence techniques with their diverse approaches and strengths can help researchers in future work to attain excellent quality of image information hiding that comprises both imperceptibility and robustness."}
{"id": "WOS:000397918700003", "title": "(Automated) planning for tomorrow: Will artificial intelligence get smarter?", "journal": "Bulletin of the Atomic Scientists", "date": "2017-01-01", "doi": "10.1080/00963402.2017.1288435", "tot_cites": "1", "abstract": "Artificial-intelligence (AI) researchers have made very considerable advances in their theoretical knowledge of planning over the past few decades. But the impact of AI on society in the coming years will depend on how much these discoveries improve the real-world performance of automated planning, or AP, an AI subfield that seeks to create computer programs that can generate plans to achieve a particular goal. If practical applications of automated planning continue to stagnate, it could hold back all of AI, even as its other subfields continue to mature. Modest progress, meanwhile, would facilitate modest economic and military uses of artificial intelligence. And should AP experience the same kind of spectacular breakout as reinforcement learning, which is being used practically in a wide variety of fields, from robotics to finance, the peril and promise of artificial intelligence might be fully realized."}
{"id": "WOS:000383757900001", "title": "Distribution of Artificial Intelligence in Digital Games", "journal": "International Journal of Intelligent Information Technologies", "date": "2015-07-01", "doi": "10.4018/IJIIT.2015070101", "tot_cites": "1", "abstract": "This paper reports on the creation of an application capable of producing intelligent character behavior based on distribution of Artificial Intelligence. To develop, test and experiment on applied Artificial Intelligence, computer games are quickly becoming the ideal simulation test bed for the implementation of computer generated AI. The application of Artificial Intelligence algorithms create immersive game-play where human players can interact with non-player characters and interactions with the environment helps shape the way in which games are played. A-Star pathfinding utilizes a heuristic function implementing cost of moving through a virtual world, this actively affects how an agent responds to a situation and can alter its decision making. This paper describes the implementation of the A-Star algorithm combined with gameplay mechanics used to simulate multi-agent communication within a randomly generated game-world."}
{"id": "WOS:000345517200014", "title": "A Study of Data Classification and Selection Techniques for Medical Decision Support Systems", "journal": "Intelligent Computing Methodologies", "date": "2014-01-01", "doi": "NA", "tot_cites": "0", "abstract": "Artificial Intelligence techniques have been increasingly used in medical decision support systems to aid physicians in their diagnosis procedures; making decisions more accurate and effective, minimizing medical errors, improving patient safety and reducing costs. Our research study indicates that it is difficult to compare different artificial intelligence techniques which are utilised to solve various medical decision-making problems using different data models. This makes it difficult to find out the most useful artificial intelligence technique among them. This paper proposes a classification approach that would facilitate the selection of an appropriate artificial intelligence technique to solve a particular medical decision making problem. This classification is based on observations of previous research studies."}
{"id": "WOS:000428761200047", "title": "Research on the Application and Influence of Auditing Artificial Intelligence", "journal": "International Conference on Education Innovation and Economic Management (Eiem 2017)", "date": "2017-01-01", "doi": "NA", "tot_cites": "0", "abstract": "The rapid development of artificial intelligence, from the Turing test of the last century to the depth of learning in this century, the emergence of robots facing the field of expertise has challenged the human society. For the audit industry, with the introduction of financial robots into the work field by the four international accounting firms, the business model of the auditing industry and the way the auditors work are faced with innovation. This paper introduces the present situation of the application of artificial intelligence in the field of audit services in the four major international accounting firms, analyzes the impact of artificial intelligence on the audit industry and the relevant auditing practitioners, and regulators who are responsible for the industry regulations. To take an in-depth analysis of the coping strategies."}
{"id": "WOS:000337892300006", "title": "Goal-Oriented Requirements Analysis and an Extended Design Pattern using Scala for Artificial Intelligence Programming Contests", "journal": "2013 3rd International Workshop on Games and Software Engineering: Engineering Computer Games to Enable Positive, Progressive Change (Gas)", "date": "2013-01-01", "doi": "NA", "tot_cites": "0", "abstract": "An artificial intelligence programming contest with game software is one of the most effective way of learning programming. Contestants can spontaneously learn programming to win in such contests. Although our previous work helps to hold artificial intelligence programming contests, its effectiveness is limited owing to an insufficient requirement analysis and uses of an unrefined design pattern. In this paper, we report on ACM JavaChallenge 2012, that is an artificial intelligence programming contest. we elicit requirements on a contest with a goal-oriented requirements analysis and extend the state design pattern using Scala to hold JavaChallenge 2012. We evaluate JavaChallenge 2012 very highly by questionnaire investigation."}
{"id": "WOS:000380535000030", "title": "The selected connection between intentionality in the philosophy of mind and informatics", "journal": "2015 Ieee 13th International Scientific Conference on Informatics", "date": "2015-01-01", "doi": "NA", "tot_cites": "0", "abstract": "The content of artificial intelligence was to explain its specific concepts and provide examples it uses. Artificial intelligence aims at imitating human behaviour or creative human activity. Theory of artificial intelligence sets its goals. It is related to various scientific disciplines which complement it and in which it searches for possible solutions. Artificial intelligence is constantly discussed by scientists, philosophers as well as laics. They are all interested in two questions - what would happen without it and what it will bring along. The aim of artificial intelligence is to get to know, understand and fully grasp certain processes. These processes are considered manifestations of human intelligence."}
{"id": "WOS:000381504200064", "title": "Blending Artificial Intelligence into PID Controller Design: A Biomedical Engineering Experiment", "journal": "Ifac Papersonline", "date": "2016-01-01", "doi": "10.1016/j.ifacol.2016.07.205", "tot_cites": "2", "abstract": "A teaching experiment is proposed in which an artificial intelligence technique is blended with classical control techniques to design PID controllers. The artificial intelligence technique deployed is currently considered one of the most popular and successfully nature and biological inspired metaheuristics: the particle swarm optimization algorithm. The teaching experiment is proposed for an introductory undergraduate Biomedical Engineering feedback control systems course. The mean arterial pressure control, quite relevant in practical application terms, is revisited. Moreover, another biomedical control problem is proposed for teaching/learning purposes: the minimum temperature control for intracranial tumor treatment. Simulation results concerning both classic and artificial intelligence based techniques for PID controller design are presented. (C) 2016, IFAC (International Federation of Automatic Control) Hosting by Elsevier Ltd. All rights reserved."}
{"id": "WOS:000428025400018", "title": "Application of Artificial Intelligence (AI) in Search Engine Optimization (SEO)", "journal": "2017 International Conference on Soft Computing, Intelligent System and Information Technology (Icsiit)", "date": "2017-01-01", "doi": "10.1109/ICSIIT.2017.15", "tot_cites": "0", "abstract": "This article discusses the application of artificial intelligence in the activities of Search Engine Optimization (SEO). Artificial intelligence is segmented into three methods: evolutionary computation, fuzzy logic, and classifiers and statistical models. Based on this division, the author seeks for scientific articles that describe the forms of application of artificial intelligence in SEO in the literature. Result obtained a number of prototypes such as Polidoxa, Fuzzy Inference System, commercial packages (SPSS Clementine and SearchDex Hyperloop), Support Vector Machine application, and the application of K-Nearest Neighbor Algorithm. Search efforts are constrained by the confidentiality of the algorithm used by SEO companies as well as from the search engines themselves."}
{"id": "WOS:000414088200052", "title": "The Application of Optimized Artificial Intelligence Algorithm in Chinese Chess", "journal": "Proceedings of the 2017 5th International Conference on Frontiers of Manufacturing Science and Measuring Technology (Fmsmt 2017)", "date": "2017-01-01", "doi": "NA", "tot_cites": "0", "abstract": "In the field of artificial intelligence, the rule of Chinese chess is different from International chess and chess and it decided that the Chinese chess artificial intelligence algorithm has its particularity. Based on the characteristics of Chinese chess, this paper analyzes the computer artificial intelligence algorithm of Chinese chess, such as game tree algorithm, historical heuristic algorithm and Alpha-Beta algorithm, and puts forward the recent activity method, dynamic sub-force method and player style method. The computational analysis shows that the improved new algorithm has a significant improvement in efficiency and speed."}
{"id": "WOS:000387128200122", "title": "Anatomy and Utilities of an Artificial Intelligence Conversational Entity", "journal": "2015 International Conference on Computational Intelligence and Communication Networks (Cicn)", "date": "2015-01-01", "doi": "10.1109/CICN.2015.122", "tot_cites": "0", "abstract": "Today is the era of intelligence in machines. Through Artificial Intelligence, machines have started to mimic various human traits today. One instance of this is the artificial intelligence conversational entities, also called chat bots, which are computer programs capable to carry out near-natural conversation with people. Chatbots are important because they are one of the most prolific examples of Human Computer Interaction (HCI). These programs are mainly serving as personal assistants these days. We programmed two working chatbots using two different programming languages, C++ and AIML, to study their construction and design practices thoroughly and to devise the further possible improvements in such kind of programs. The paper focuses a discussion about Artificial Intelligence via chat bots, their framework design, capabilities, utilization and future scope."}
{"id": "WOS:000427346000042", "title": "IEEE Standard Review - Ethically Aligned Design: A Vision for Prioritizing Human Wellbeing with Artificial Intelligence and Autonomous Systems", "journal": "2017 Ieee Canada International Humanitarian Technology Conference (Ihtc)", "date": "2017-01-01", "doi": "NA", "tot_cites": "0", "abstract": "In September 2009, the IEEE Board of Directors approved the new IEEE tagline - Advancing Technology for Humanity - as recommended by the IEEE Public Visibility Committee. Aligned with the IEEE tagline, IEEE Standards Association takes the initiative to address ethics in engineering design under \"Ethically Aligned Design: A Vision for Prioritizing Human Wellbeing with Artificial Intelligence and Autonomous Systems\" focusing on Artificial Intelligence and Autonomous Systems (AI/AS). The intention is to cover, as much as possible, the ethical concerns on AI/AS through a rigorous regard to the problem from different perspectives. The ultimate objective of this ongoing initiative is to provide guidelines/procedures/standards to prioritize human wellbeing in the forthcoming evolutions on artificial intelligence and autonomous systems. This article reviews different aspects addressed in Version 1 of this initiative."}
